import re

class Pattern:

    def get_pattern_date(self, lang = "hindi"):
        
        if lang == "hindi":
            return {
                "DayToNext": [r"\s+(अगले |अगला |नेक्स्ट |next |)\s*(\d{1,2})\s+(दिन|दिनों|दिनो|डेज|डे|days|day)\s+(बाद |पहले |अंदर |)\s*(में |)", ["int", "mod"], "Day"],
                "IntervalDays": [r"\s+(\d{1,2} |)\s*(- |से |या |और |तो |)\s*(\d{1,2})\s+(दिन|दिनों|दिनो|डेज|डे|days|day)\s+(बाद |पहले |अंदर |)\s*(में |तक |)\s*", ["int", "mod"], "Day"],
                "DayToNext2": [r"\s+(\d{1,2} |)\s*(- |से |या |और |तो |)\s*(\d{1,2})\s+(दिन|दिनों|दिनो|डेज|डे|days|day)\s+(के |)\s*(बाद|अंदर|पहले)\s+", ["int", "mod"], "Day"],
                "DayToNext3": [r"\s+(\d{1,2} |)\s*(- |से |या |और |तो |)\s*(\d{1,2})\s+(दिन|दिनों|दिनो|डेज|डे|days|day)\s+(का |के |)\s*(टाइम|time)", ["int", "mod"], "Day"],
                "DateFill1": [r"\s+(\d{1,2} |)\s*(- |से |या |और |तो |)\s*(\d{1,2})\s+(जनवरी|फरवरी|फेब्रुअरी|फेब्रुवारी|मार्च|अप्रैल|मई|जून|जुलाई|अगस्त|सितम्बर|सितंबर|सप्टेंबर|सेप्टेम्बर|सेप्तेम्बर|सेप्टैंबर|अक्टूबर|नवंबर|दिसंबर|january|february|march|april|may|june|july|august|september|october|november|december|jan|feb|sept|oct|nov|dec)\s+(\d{4} |)\s*(को |तक |के पहले |)\s*", ["int", "month", "year"], "Date"],
                "DateFill2": [r"\s+(जनवरी|फरवरी|फेब्रुअरी|फेब्रुवारी|मार्च|अप्रैल|मई|जून|जुलाई|अगस्त|सितम्बर|सितम्बर|सितंबर|सप्टेंबर|सेप्टेम्बर|सेप्तेम्बर|सेप्टैंबर|अक्टूबर|नवंबर|दिसंबर|january|february|march|april|may|june|july|august|september|october|november|december|jan|feb|sept|oct|nov|dec)\s+(\d{1,2} |)\s*(तारीख |)\s*(को |तक |के पहले |में |)\s*", ["int", "month"], "Date"],
                "DateFill3": [r"\s+(जनवरी|फरवरी|फेब्रुवारी|फेब्रुअरी|मार्च|अप्रैल|मई|जून|जुलाई|अगस्त|सितम्बर|सितंबर|सप्टेंबर|सेप्टेम्बर|सेप्तेम्बर|सेप्टैंबर|अक्टूबर|नवंबर|दिसंबर|january|february|march|april|may|june|july|august|september|october|november|december|jan|feb|sept|oct|nov|dec)\s+(एंड|आखिर|लास्ट|एंडिंग|end|ending|last)\s+(में |तक |)\s*(\d{1,2} |)\s*", ["int", "month", "end"], "Date"],
                "DateFill4": [r"\s+(\d{1,2} |)\s*(- |से |या |और |तो )\s*(\d{1,2})\s+(को|तक|के पहले|से पहले|तो|कोई)\s+", ["int"], "Date"],
                "DateFill5": [r"\s+(\d{1,2} |)\s*(- |से |या |और |तो |to |)\s*(\d{1,2})\s+(तारीख|डेट|तिथि|दिनांक|date)\s+(तक |में |)\s*", ["int"], "Date"],
                "DateMonthEnd": [r"\s+(इस |यह |थिस |दिस |this |)\s*(मंथ|महीने|माह|महीना|month)\s*( के|)\s+(एंड |आखिर |लास्ट |end |last |)\s*(तक |को |में |की |)\s*(\d{1,2} |)\s*", ["future_mod0", "int", "end"], "Month"],
                "DateNextMonthStart": [r"\s+(अगला|अगले|नेक्स्ट|next)\s+(मंथ|महीने|माह|महीनो|महीनों|महीना|month)\s+(की |पे |तक |)\s*(\d{1,2} |)\s*(तारीख |)\s*", ["future_mod1", "int"], "Month"],
                "DateNextMonthEnd": [r"\s+(अगला|अगले|नेक्स्ट|next)\s+(मंथ|महीने|माह|महीनो|महीनों|महीना|month)\s+(के |)\s*(एंड|आखिर|लास्ट|एंडिंग|end|last|ending)\s*(तक |को |में |)\s*", ["future_mod1", "int", "end"], "Month"],
                "DateXMonthEnd": [r"\s+(\d{1,2})\s+(मंथ|महीने|माह|महीनो|महीनों|महीना|month)\s+(तक |में |के |)\s*(बाद |later |)\s*", ["int"], "Month"],
                "CurrentDate": [r"\s+(तुरंत|अभी|आज|टुडे|टुडेस|दोपहर|आजकल)\s+(ही |में |)\s*", ["future_mod0"], "Day"],
                "CurrentEveningDate": [r"\s+(शाम|रात|नाईट|सुबह|मॉर्निंग|आफ्टरनून|दोपहर)\s+(तक |को |में |)\s*", ["future_mod0"], "Day"],
                "TomorrowDate": [r"\s+(कल|टुमारो|नेक्स्ट डे|नेक्स्ट डेट|next day|tomorrow)\s+(शाम |रात |नाईट |सुबह |मॉर्निंग |आफ्टरनून |दोपहर |)\s*(तक |में |कर |को |)\s*", ["future_mod1"], "Day"],
                "DayAfterTomorrowDate": [r"\s+(परसों|परसु|परसो|डे आफ्टर टुमारो|टूडेज|day after tomorrow|two days)\s+(शाम |रात |नाईट |सुबह |मॉर्निंग |आफ्टरनून |दोपहर |)\s*(तक |में |कर |को |)\s*", ["future_mod2"], "Day"],
                "NextWeek": [r"\s*( अगला| अगले| नेक्स्ट|next |)\s+(हफ्ते|हफ्ता|वीक|सप्ताह|week)\s+(तक |में |के पहले |बाद |पहले |अंदर |)\s*", ["future_mod1", "mod"], "Week"],
                "NextXWeek": [r"( अगला| अगले| नेक्स्ट|next |)\s+(\d{1,2})\s+(हफ्ते|हफ्ता|वीक|सप्ताह|week|weeks)\s+(तक |में |के पहले |बाद |पहले |अंदर |)\s*", ["int", "mod"], "Week"],
                "GetWeek": [r"\s+(अगला |अगले |नेक्स्ट |अगली |next |)\s*(रविवार|संडे|सोमवार|मंडे|मंगलवार|ट्यूसडे|बुधवार|वेडनेसडे|वेनसडे|गुरुवार|थर्सडे|शुक्रवार|फ्राइडे|शनिवार|सैटरडे|सेटरडे|monday|tuesday|wednesday|thursday|friday|saturday|sunday)\s+(तक |में |)", ["future_mod1", "weekday"], "Week"],
                "LastWeekOfMonth": [r"\s+(आखरी|एंड|आखिर|लास्ट|एंडिंग|next|end|last|ending)\s+(हफ्ते|हफ्ता|वीक|सप्ताह|week)\s+(तक |में |को |)\s*", ["end"], "Date"],
                "NextYear": [r"\s+(अगले|अगला|नेक्स्ट|1|एक|वन|next)\s+(साल|ईयर|year)\s+(तक |में |बाद |)\s*", ["future_mod1"], "Year"],
                "NextXYear": [r"( अगला| अगले| नेक्स्ट|next |)\s+(\d{1,2})\s+(साल|ईयर|year)\s+(तक |में |बाद |)\s*", ["int"], "Year"],
                "NextMonthWeek": [r"\s+(अगला|अगले|नेक्स्ट|next)\s+(मंथ|महीने|माह|महीनो|महीनों|महीना|month)\s+(की |पे |तक |के |)\s*(\d{1} |)\s*(रविवार|संडे|सोमवार|मंडे|मंगलवार|ट्यूसडे|बुधवार|वेडनेसडे|वेनसडे|गुरुवार|थर्सडे|शुक्रवार|फ्राइडे|शनिवार|सैटरडे|सेटरडे|monday|tuesday|wednesday|thursday|friday|saturday|sunday)\s+(को |के |)\s*(बाद |पहले |अंदर |)", ["future_mod1", "int", "weekday", "mod"], "MonthWeek"],
                "EndOfThisWeek": [r"\s+((आखरी|एंड|आखिर|लास्ट|एंडिंग|next|end|last|ending)\s+(of |)\s*(this |the |)\s*(हफ्ते|हफ्ता|वीक|सप्ताह|week))|(weekend)\s+",["future_mod1", "end"], "Week"],
                "EndOfNextWeek": [r"\s+((आखरी|एंड|आखिर|लास्ट|एंडिंग|next|end|last|ending)\s+(of |)\s*(the |)\s*((अगले|अगला|नेक्स्ट|next))\s+(हफ्ते|हफ्ता|वीक|सप्ताह|week))|(next weekend)\s+",["future_mod2", "end"], "Week"],
                "EndOfXWeek": [r"\s+(आखरी|एंड|आखिर|लास्ट|एंडिंग|next|end|last|ending)\s+(of |)\s*(the |)\s*(अगले |अगला |नेक्स्ट |next |)\s*((\d{1,2}))\s*(हफ्ते|हफ्ता|वीक|सप्ताह|week)\s+",["int", "end"], "Week"]
            }

        if lang == "kannada":
            return {
                "DayToNext": [r"( ಮುಂದೆ| ಮುಂದಿನ| ಬರೋ| ಮುಂದಿನ್| ಬರು| ಬರುವ| ನೆಕ್ಸ್ಟ್| ಬರ್ತಿರೋ|)\s+(\d{1,2})\s+(ದಿನ|ದಿನ್|ಡೇ|ಡೇಸ್|ಡೆ|ಡೇಜ್|ದಿನದ|ದಿನದಲ್ಲಿ|ದಿನಗಳಲ್ಲಿ|ದಿನಗಳ|ದಿನಗಳು|ದಿವಸ|ದಿಸ|ದಿನದಂದು|ದಿವಸದಲ್ಲಿ|ದಿವ್ಸ|ದಿನದಲ್ಲೇ)\s+(ನಂತರ |ಆಮೇಲೆ |ಆದ್ಮೇಲೆ |ನಂತ್ರಾ |ಮೇಲೆ |ಮೇಲೇ |ಮತ್ತೆ |ಒಲ್ಗಡೆ |ಒಲ್ಗಡೆನೆ |ಒಳಗೆ |ಮುಂಚಿತವಾಗಿ |ಮುಂಚೆಯೇ |ಮುಂಚೆನೇ |ಮುಂಚೆ |)\s*(ಕೇ |ಕ್ಕೆ |ಕ್ಕೇ |ನೇ |ಗೆ |ಗೇ |ರಂದು |ವರೆಗೆ |)\s*",["int", "mod"], "Day"],
                "IntervalDays": [r"\s+(\d{1,2} |)\s*(- |ಇಂದ |ಇಂದಾ |ಅಥವಾ |ಮತ್ತೆ |ರಿಂದ |ಇಲ್ಲ |)\s*(\d{1,2})\s+(ದಿನ|ದಿನ್|ಡೇ|ಡೇಸ್|ಡೆ|ಡೇಜ್|ದಿನದ|ದಿನದಲ್ಲಿ|ದಿನಗಳಲ್ಲಿ|ದಿನಗಳ|ದಿನಗಳು|ದಿವಸ|ದಿಸ|ದಿನದಂದು|ದಿವಸದಲ್ಲಿ|ದಿವ್ಸ|ದಿನದಲ್ಲೇ)\s*( ನಂತರ|ಆಮೇಲೆ|ಆದ್ಮೇಲೆ|ನಂತ್ರಾ|ಮೇಲೆ|ಮೇಲೇ|ಮತ್ತೆ|ಒಲ್ಗಡೆ |ಒಲ್ಗಡೆನೆ |ಒಳಗೆ |ಮುಂಚಿತವಾಗಿ |ಮುಂಚೆಯೇ |ಮುಂಚೆನೇ |ಮುಂಚೆ |)\s*( ಕೇ| ಕ್ಕೆ| ಕ್ಕೇ| ನೇ| ಗೆ| ಗೇ| ರಂದು| ವರೆಗೆ|)\s+",["int", "mod"], "Day"],
                "DayToNext2": [r"\s+(\d{1,2} |)\s*(- |ಇಂದ |ಇಂದಾ |ಅಥವಾ |ಮತ್ತೆ |ರಿಂದ |ಇಲ್ಲ |)\s*(\d{1,2})\s+(ದಿನ|ದಿನ್|ಡೇ|ಡೇಸ್|ಡೆ|ಡೇಜ್|ದಿನದ|ದಿನದಲ್ಲಿ|ದಿನಗಳಲ್ಲಿ|ದಿನಗಳ|ದಿನಗಳು|ದಿನದೊಳಗೆ|ದಿನದೊಳಗಡೆ|ದಿನದೊಳಗಡೆನೇ|ದಿನದೊಲ್ಗಡೆನೆ|ದಿವಸ|ದಿಸ|ದಿನದಂದು|ದಿವಸದಲ್ಲಿ|ದಿವ್ಸ|ದಿನದಲ್ಲೇ)\s+(ನಂತರ |ಆಮೇಲೆ |ಆದ್ಮೇಲೆ |ನಂತ್ರಾ |ಮೇಲೆ |ಮೇಲೇ |ಒಲ್ಗಡೆ |ಒಲ್ಗಡೆನೆ |ಒಳಗೆ |ಮುಂಚಿತವಾಗಿ |ಮುಂಚೆಯೇ |)\s*",["int", "mod"], "Day"],
                "DayToNext3": [r"\s+(\d{1,2} |)\s*(- |ಇಂದ |ಇಂದಾ |ಅಥವಾ |ಮತ್ತೆ |ರಿಂದ |ಇಲ್ಲ |)\s*(\d{1,2})\s+(ದಿನ|ದಿನ್|ಡೇ|ಡೇಸ್|ಡೆ|ಡೇಜ್|ದಿನದ|ದಿನದಲ್ಲಿ|ದಿನಗಳಲ್ಲಿ|ದಿನಗಳ|ದಿನಗಳು|ದಿವಸ|ದಿಸ|ದಿನದಂದು|ದಿವಸದಲ್ಲಿ|ದಿವ್ಸ|ದಿನದಲ್ಲೇ)\s+(ಸಮಯ |ಸಮಯದಲ್ಲಿ |ಟೈಮಿಗೆ |ಟೈಮಲ್ಲಿ |ಟೈಮ್ |)\s*",["int", "mod"], "Day"],
                "DateFill1": [r"\s+(\d{1,2} |)\s*(- |ಇಂದ |ಇಂದಾ |ಅಥವಾ |ಮತ್ತೆ |ರಿಂದ |ಇಲ್ಲ |)\s*(\d{1,2})\s+(ಜನವರಿ|ಜ್ಯಾನ್ವರಿ|ಫೆಬ್|ಫೆಬ್ರವರಿ|ಫೆಬ್ರುವರಿ|ಮಾರ್ಚ್|ಏಪ್ರಿಲ್|ಮೇ|ಜೂನ್|ಜುನ್|ಜೂಲೈ|ಜುಲೈ|ಜುಲೈನಲ್ಲಿ|ಆಗಸ್ಟ್|ಅಗಸ್ಟಿಗೆ|ಅಗಸ್ಟ್|ಸೆಪ್ಟೆಂಬರ್|ಅಕ್ಟೋಬರ್|ನೋವೊಂಬೆರ್|ನವೆಂಬರ್|ಡಿಸೆಂಬರ್)\s+(\d{4} |)\s*(ಗೆ |ಗೇ |ವರೆಗೆ |ಮುಂಚೆನೇ |ಮುಂಚೆ |ಮೊದಲು |ಮೊದಲೇ |ಒಲ್ಗಡೆ |ಒಲ್ಗಡೆನೆ |ಒಳಗೆ |ಮುಂಚಿತವಾಗಿ |ಮುಂಚೆಯೇ |)\s*", ["int", "month", "year"], "Date"],
                "DateFill2": [r"\s+(ಜನವರಿ|ಜ್ಯಾನ್ವರಿ|ಫೆಬ್|ಫೆಬ್ರವರಿ|ಫೆಬ್ರುವರಿ|ಮಾರ್ಚ್|ಏಪ್ರಿಲ್|ಮೇ|ಜೂನ್|ಜುನ್|ಜೂಲೈ|ಜುಲೈ|ಜುಲೈನಲ್ಲಿ|ಆಗಸ್ಟ್|ಅಗಸ್ಟಿಗೆ|ಅಗಸ್ಟ್|ಸೆಪ್ಟೆಂಬರ್|ಅಕ್ಟೋಬರ್|ನೋವೊಂಬೆರ್|ನವೆಂಬರ್|ಡಿಸೆಂಬರ್)\s+(\d{1,2} |)\s*(ತಾರೀಖ್ |ತಾರೀಕಿನ |ತಾರೀಕ್ |ತಾರೀಖಿಗೆ |ತಾರೀಕಿಗೆ |ತಾರೀಕು |ತಾರೀಖು |ದಿನಾಂಕ |ನೇ ತಾರೀಖ್ |ನೇ ತಾರೀಕಿನ |ನೇ ತಾರೀಕ್ |ನೇ ತಾರೀಖಿಗೆ |ನೇ ತಾರೀಕಿಗೆ |ನೇ ತಾರೀಕು |ನೇ ತಾರೀಖು |ತಾರಿಖಿಗೆ |ದಿನಾಂಕಕ್ಕೆ |ದಿನಾಂಕದೊಳಗೆ |ತಾರೀಖಿನೊಳಗೆ |ದಿನಾಂಕದ |ತಾರೀಖಿನ |ತಾರೀಖಿನಂದು |ತಾರಿಕ್ |)\s*(ಗೆ |ಗೇ |ವರೆಗೆ|ವರೆಗಿನ|ಮುಂಚೆನೇ |ಮುಂಚೆ |ಮೊದಲು |ಮೊದಲೇ |ಒಲ್ಗಡೆ |ಒಲ್ಗಡೆನೆ |ಒಳಗೆ |ಮುಂಚಿತವಾಗಿ |ಮುಂಚೆಯೇ |)\s*", ["int", "month"], "Date"],
                "DateFill3": [r"\s+(ಜನವರಿ|ಜ್ಯಾನ್ವರಿ|ಫೆಬ್|ಫೆಬ್ರವರಿ|ಫೆಬ್ರುವರಿ|ಮಾರ್ಚ್|ಏಪ್ರಿಲ್|ಮೇ|ಜೂನ್|ಜುನ್|ಜೂಲೈ|ಜುಲೈ|ಜುಲೈನಲ್ಲಿ|ಆಗಸ್ಟ್|ಅಗಸ್ಟಿಗೆ|ಅಗಸ್ಟ್|ಸೆಪ್ಟೆಂಬರ್|ಅಕ್ಟೋಬರ್|ನೋವೊಂಬೆರ್|ನವೆಂಬರ್|ಡಿಸೆಂಬರ್)\s+(ಎಂಡ್|ಎಂಡಿಗೆ|ಕೊನೆಯಲ್ಲಿ|ಕೊನೆಗೆ|ಎಂದಲ್ಲಿ|ಅಂತ್ಯಕ್ಕೆ|ಅಂತ್ಯದಲ್ಲಿ|ಲಾಸ್ಟ|ಲಾಸ್ಟಿಗೆ|ಲಾಸ್ಟಲ್ಲಿ|ಅಂತಿಮದಲ್ಲಿ|ಅಂತ್ಯದೊಳ್ಗೆ|ಎಂಡಿಗೆ|ಎಂಡ್ಗೆ)\s*(ಗೆ |ಗೇ |ವರೆಗೆ |ವರೆಗಿನ |ಕೇ |ಕ್ಕೆ |ಕ್ಕೇ |ನೇ |ಗೆ |ಗೇ |ರಂದು |)\s*(\d{1,2} |)\s*", ["int", "month", "end"], "Date"],
                "DateFill4": [r"\s+(\d{1,2} |)\s*(- |ಇಂದ |ಇಂದಾ |ಅಥವಾ |ಮತ್ತೆ |ರಿಂದ |ಇಲ್ಲ |)\s*(\d{1,2})\s*(ಗೆ|ಗೇ|ವರೆಗೆ|ವರೆಗಿನ|ಮುಂಚೆನೇ|ಮುಂಚೆ|ಮೊದಲು|ಮೊದಲೇ|ಒಲ್ಗಡೆ|ಒಲ್ಗಡೆನೆ|ಒಳಗೆ|ಮುಂಚಿತವಾಗಿ|ಮುಂಚೆಯೇ|ನಂತರ| ಆಮೇಲೆ|ಆದ್ಮೇಲೆ|ನಂತ್ರಾ|ಮೇಲೆ|ಮೇಲೇ|ಮತ್ತೆ|ರಂದು)\s+", ["int"], "Date"],
                "DateFill5": [r"\s+(\d{1,2} |)\s*(- |ಇಂದ |ಇಂದಾ |ಅಥವಾ |ಮತ್ತೆ |ರಿಂದ |ಇಲ್ಲ |)\s*(\d{1,2})\s+(ತಾರೀಖ್|ತಾರೀಕಿನ |ತಾರೀಕ್|ತಾರೀಖಿಗೆ|ತಾರೀಕಿಗೆ|ತಾರೀಕು|ತಾರೀಖು|ದಿನಾಂಕ|ನೇ ತಾರೀಖ್|ನೇ ತಾರೀಕಿನ|ನೇ ತಾರೀಕ್|ನೇ ತಾರೀಖಿಗೆ|ನೇ ತಾರೀಕಿಗೆ|ನೇ ತಾರೀಕು|ನೇ ತಾರೀಖು|ತಾರಿಖಿಗೆ|ದಿನಾಂಕಕ್ಕೆ|ದಿನಾಂಕದೊಳಗೆ|ತಾರೀಖಿನೊಳಗೆ|ದಿನಾಂಕದ|ತಾರೀಖಿನ|ತಾರೀಖಿನಂದು|ತಾರಿಕ್)\s+(ಗೆ |ಗೇ |ವರೆಗೆ |ವರೆಗಿನ |ಕೇ |ಕ್ಕೆ |ಕ್ಕೇ |ನೇ |ಗೆ |ಗೇ |ರಂದು |)\s*", ["int"], "Date"],
                "DateMonthEnd": [r"\s+(ಇದರಲ್ಲಿ |ಇದರ |ಇದು |ಇದರಂಗೇ |ಇದೆ |ಇ |ಈ |ದಿಸ್ |)\s*(ತಿಂಗ್ಳು|ತಿಂಗಳು|ತಿಂಗಳುಗಳು|ಮಂತ್|ತಿಂಗಳ|ತಿಂಗಳಲ್ಲಿ|ತಿಂಗ್ಳ್|ತಿಂಗಳಿಗೆ|ತಿಂಗಳಂಗೆ|ತಿಂಗಳಾದ|ತಿಂಗಳೊಳಗೆ|ಮಂಥ)\s+(ಎಂಡ್ |ಎಂಡಿಗೆ |ಕೊನೆಯಲ್ಲಿ |ಕೊನೆಗೆ |ಎಂದಲ್ಲಿ |ಅಂತ್ಯಕ್ಕೆ |ಅಂತ್ಯದಲ್ಲಿ |ಲಾಸ್ಟ |ಲಾಸ್ಟಿಗೆ |ಲಾಸ್ಟಲ್ಲಿ |ಅಂತಿಮದಲ್ಲಿ |ಅಂತ್ಯದೊಳ್ಗೆ |ಎಂಡಿಗೆ |ಎಂಡ್ಗೆ |)\s*(ಗೆ |ಗೇ |ವರೆಗೆ |ವರೆಗಿನ |ಕೇ |ಕ್ಕೆ |ಕ್ಕೇ |ನೇ |ಗೆ |ಗೇ |ರಂದು |)\s*(\d{1,2} |)\s*", ["future_mod0", "int", "end"], "Month"],
                "DateNextMonthStart": [r"\s+(ಮುಂದಿನ|ಬರೋ|ಮುಂದಿನ್|ಬರು|ಬರುವ|ನೆಕ್ಸ್ಟ್|ಬರ್ತಿರೋ)\s+(ತಿಂಗ್ಳು|ತಿಂಗಳು|ತಿಂಗಳುಗಳು|ಮಂತ್|ತಿಂಗಳ|ತಿಂಗಳಲ್ಲಿ|ತಿಂಗ್ಳ್|ತಿಂಗಳಿಗೆ|ತಿಂಗಳಂಗೆ|ತಿಂಗಳಾದ|ತಿಂಗಳೊಳಗೆ|ಮಂಥ)\s+(\d{1,2} |)\s*", ["future_mod1", "int"], "Month"],
                "DateNextMonthEnd": [r"\s+(ಮುಂದಿನ|ಬರೋ|ಮುಂದಿನ್|ಬರು|ಬರುವ|ನೆಕ್ಸ್ಟ್|ಬರ್ತಿರೋ)\s+(ತಿಂಗ್ಳು|ತಿಂಗಳು|ತಿಂಗಳುಗಳು|ಮಂತ್|ತಿಂಗಳ|ತಿಂಗಳಲ್ಲಿ|ತಿಂಗ್ಳ್|ತಿಂಗಳಿಗೆ|ತಿಂಗಳಂಗೆ|ತಿಂಗಳಾದ|ತಿಂಗಳೊಳಗೆ|ಮಂಥ)\s+(ಎಂಡ್|ಎಂಡಿಗೆ|ಕೊನೆಯಲ್ಲಿ|ಕೊನೆಗೆ|ಎಂದಲ್ಲಿ|ಅಂತ್ಯಕ್ಕೆ|ಅಂತ್ಯದಲ್ಲಿ|ಲಾಸ್ಟ|ಲಾಸ್ಟಿಗೆ|ಲಾಸ್ಟಲ್ಲಿ|ಅಂತಿಮದಲ್ಲಿ|ಅಂತ್ಯದೊಳ್ಗೆ|ಎಂಡಿಗೆ|ಎಂಡ್ಗೆ)\s*", ["future_mod1", "int", "end"], "Month"],
                "DateXMonthEnd": [r"\s+(\d{1,2})\s+(ತಿಂಗ್ಳು|ತಿಂಗಳು|ತಿಂಗಳುಗಳು|ಮಂತ್|ತಿಂಗಳ|ತಿಂಗಳಲ್ಲಿ|ತಿಂಗ್ಳ್|ತಿಂಗಳಿಗೆ|ತಿಂಗಳಂಗೆ|ತಿಂಗಳಾದ|ತಿಂಗಳೊಳಗೆ|ಮಂಥ)\s+(ನೇ |ರಂದು |ವರೆಗೆ |)", ["int"], "Month"],
                "CurrentDate": [r"\s+(ಇವತ್ತು|ಇಂದು|ಇವಾಗ್|ಟುಡೇ|ಟುಡೆ|ಇವತ್|ಇವತ್ತ|ಇಂದೇ|ಇವತ್ತೆ|ಇವಾಗ|ಈಗ|ಈಗಲೇ|ಇವಾಗ್ಲೆ|ಈಗಿನಿಂದಲೇ|ಈಗಲೆ|ಕೂಡಲೇ|ಕುಡ್ಲೆ|ಇಂದಿಗೆ|ಇಮ್ಮಿಡಿಯೇಟಲಿ|ತಕ್ಷಣ|ತಕ್ಷಣವೇ|ಇಂದಿನ|ಇವತ್ತಿನ|ಇವತ್ತೇ|ಇವಾಗ್ಲೇ|ಇವಾಗಲೇ|ಇವಾಗೆ|ಈಗ್ಲೇ|ಇಂದಿಗಾಗಲೇ|ಇಂದಿನೊಳಗೆ)\s+(ನ |ಒಳಗೆ |ಒಳಗಡೆ |ಒಲ್ಗೇನೆ |)\s*", ["future_mod0"], "Day"],
                "CurrentEveningDate": [r"\s+(ಸಾಯಂಕಾಲ|ಸಂಜೆ|ಬೆಳೆಗೆ|ಇವಿನಿಂಗ್|ಮಾರ್ನಿಂಗ್|ನೈಟ್|ಬೆಳಿಗೆ|ರಾತ್ರಿ| ರಾತ್ರಿಗೆ|ಸಂಜೆಗೆ|ರಾತ್ರಿನೇ|ಬೆಳೆಗೇನೆ|ಮಧ್ಯಾಹ್ನ|ಆಫ್ಟರ್ನೂನ್|ಆಫ್ಟರ್ ನೂನ್|ಸಂಜೆಯೊಳಗೆ|ಬೆಳಿಗೆಯೊಳಗೆ|ರಾತ್ರಿಯೊಳಗೆ|ಮಧ್ಯಾಹ್ನದೊಳಗೆ|ರಾತ್ರಿಯವರೆಗೆ|ಬೆಳಗ್ಗೆ|ಸಂಜೆಯ|ಬೆಳಿಗ್ಗೆ)\s+(ಗೆ |ಗೇ |ವರೆಗೆ |ಕೇ |ಕ್ಕೆ |ಕ್ಕೇ |ನೇ |ಗೆ |ಗೇ |ರಂದು |)", ["future_mod0"], "Day"],
                "TomorrowDate": [r"\s+(ನಾಳೆ|ಟುಮಾರೋ|ನಾಳೇನೇ|ನಾಳೆನೆ|ನಾಳೆನೇ|ನಾಲೆ|ಮರುದಿನ|ನಾಳೆಗೆ|ನಾಳೆಯ)\s+(ಸಾಯಂಕಾಲ |ಸಂಜೆ |ಬೆಳೆಗೆ |ಇವಿನಿಂಗ್ |ಮಾರ್ನಿಂಗ್ |ನೈಟ್ |ಬೆಳಿಗೆ |ರಾತ್ರಿ | ರಾತ್ರಿಗೆ |ಸಂಜೆಗೆ |ರಾತ್ರಿನೇ |ಬೆಳೆಗೇನೆ |ಮಧ್ಯಾಹ್ನ |ಆಫ್ಟರ್ನೂನ್ |ಆಫ್ಟರ್ ನೂನ್ |ಸಂಜೆಯೊಳಗೆ |ಬೆಳಿಗೆಯೊಳಗೆ |ರಾತ್ರಿಯೊಳಗೆ |ಮಧ್ಯಾಹ್ನದೊಳಗೆ |ರಾತ್ರಿಯವರೆಗೆ |ಬೆಳಗ್ಗೆ |ಸಂಜೆಯ |ಬೆಳಿಗ್ಗೆ |)\s*(ಮಾಡ್ತೀನಿ |ಮಾಡುತ್ತೇನೆ |ಮಾಡೋಣ |ಮಾಡ್ತೇನೆ |ಮಾಡಬಹುದು |ಗೆ |ಗೇ |ಒಳಗೆ |ಒಳಗಡೆ |ಒಲ್ಗೇನೆ |)\s*", ["future_mod1"], "Day"],
                "DayAfterTomorrowDate": [r"\s+(ನಾಳಿದ್ದು|ನಾಡಿದ್ದು|ಡೇ ಆಫ್ಟರ್ ಟುಮಾರೋ|ನಾಡ್ ಇದ್|ಟುಡೇಸ್)\s+(ಸಾಯಂಕಾಲ |ಸಂಜೆ |ಬೆಳೆಗೆ |ಇವಿನಿಂಗ್ |ಮಾರ್ನಿಂಗ್ |ನೈಟ್ |ಬೆಳಿಗೆ |ರಾತ್ರಿ | ರಾತ್ರಿಗೆ |ಸಂಜೆಗೆ |ರಾತ್ರಿನೇ |ಬೆಳೆಗೇನೆ |ಮಧ್ಯಾಹ್ನ |ಆಫ್ಟರ್ನೂನ್ |ಆಫ್ಟರ್ ನೂನ್ |ಸಂಜೆಯೊಳಗೆ |ಬೆಳಿಗೆಯೊಳಗೆ |ರಾತ್ರಿಯೊಳಗೆ |ಮಧ್ಯಾಹ್ನದೊಳಗೆ |ರಾತ್ರಿಯವರೆಗೆ |ಬೆಳಗ್ಗೆ |ಸಂಜೆಯ |ಬೆಳಿಗ್ಗೆ |)\s*(ಮಾಡ್ತೀನಿ |ಮಾಡುತ್ತೇನೆ |ಮಾಡೋಣ |ಮಾಡ್ತೇನೆ |ಮಾಡಬಹುದು |ಗೆ |ಗೇ |ಒಳಗೆ |ಒಳಗಡೆ |ಒಲ್ಗೇನೆ |)\s*", ["future_mod2"], "Day"],
                "NextWeek": [r"\s*( ಮುಂದೆ| ಮುಂದಿನ| ಬರೋ| ಮುಂದಿನ್| ಬರು| ಬರುವ| ನೆಕ್ಸ್ಟ್| ಬರ್ತಿರೋ|)\s*(ವಾರದ|ವೀಕ್|ವಾರ|ವಾರದಲ್ಲಿ|ವೀಕಲ್ಲಿ|ವಾರ|ವಾರದ|ವಾರದೊಳಗೆ|ವೀಕೆಂಡ್|ವೀಕೆಂಡಲ್ಲಿ)\s+(ಒಳಗೆ |ಒಳಗಡೆ |ಒಲ್ಗೇನೆ |ವರೆಗೆ |ಮುಂಚಿತವಾಗಿ |ಮುಂಚೆಯೇ |ಮುಂಚೆನೇ |ಮುಂಚೆ |)\s*", ["future_mod1", "mod"], "Week"],
                "NextXWeek": [r"( ಮುಂದೆ| ಮುಂದಿನ| ಬರೋ| ಮುಂದಿನ್| ಬರು| ಬರುವ| ನೆಕ್ಸ್ಟ್| ಬರ್ತಿರೋ|)\s+(\d{1,2})\s+(ವಾರದ|ವೀಕ್|ವಾರ|ವಾರದಲ್ಲಿ|ವೀಕಲ್ಲಿ|ವಾರ|ವಾರದ|ವಾರದೊಳಗೆ|ವೀಕೆಂಡ್|ವೀಕೆಂಡಲ್ಲಿ)\s+(ಒಳಗೆ |ಒಳಗಡೆ |ಒಲ್ಗೇನೆ |ಮುಂಚಿತವಾಗಿ |ಮುಂಚೆಯೇ |ಮುಂಚೆನೇ |ಮುಂಚೆ |)", ["int", "mod"], "Week"],
                "GetWeek": [r"\s+(ಮುಂದೆ |ಮುಂದಿನ |ಬರೋ |ಮುಂದಿನ್ |ಬರು |ಬರುವ |ನೆಕ್ಸ್ಟ್ |ಬರ್ತಿರೋ |)\s*(ಸೋಮವಾರ|ಸೋಮ್ವಾರ|ಮಂಡೇ|ಮಂಡೆ|ಮಂಗಳವಾರ|ಟ್ಯೂಸ್ಡೇ|ಬುಧವಾರ|ವೆಡ್ನೆಸ್ಡೇ|ಬುದುವಾರ|ಗುರುವಾರ|ಥರ್ಸ್ಡೇ|ಶುಕ್ರವಾರ|ಫ್ರೈಡೇ|ಶುಕ್ರುವಾರ|ಶನಿವಾರ|ಸಾಟರ್ಡೆ|ಭಾನುವಾರ|ಸಂಡೆ|ರವಿವಾರ|ಆದಿತ್ಯವಾರ|ಫ್ರೈಡೆ|ಶುಕ್ರವಾರದೊಳಗೆ)\s+(ಒಳಗೆ |ಒಳಗಡೆ |ಒಲ್ಗೇನೆ |)\s*", ["future_mod1", "weekday"], "Week"],
                "LastWeekOfMonth": [r"\s+(ಎಂಡ್|ಎಂಡಿಗೆ|ಕೊನೆಯಲ್ಲಿ|ಕೊನೆಗೆ|ಎಂದಲ್ಲಿ|ಅಂತ್ಯಕ್ಕೆ|ಅಂತ್ಯದಲ್ಲಿ|ಲಾಸ್ಟ|ಲಾಸ್ಟಿಗೆ|ಲಾಸ್ಟಲ್ಲಿ|ಅಂತಿಮದಲ್ಲಿ|ಅಂತ್ಯದೊಳ್ಗೆ|ಎಂಡಿಗೆ|ಎಂಡ್ಗೆ)\s+(ವಾರದ|ವೀಕ್|ವಾರ|ವಾರದಲ್ಲಿ|ವೀಕಲ್ಲಿ|ವಾರ|ವಾರದ|ವಾರದೊಳಗೆ|ವೀಕೆಂಡ್|ವೀಕೆಂಡಲ್ಲಿ)\s+(ಗೆ |ಗೇ |ವರೆಗೆ |ವರೆಗಿನ |ಕೇ |ಕ್ಕೆ |ಕ್ಕೇ |ನೇ |ಗೆ |ಗೇ |ರಂದು |)\s*", ["end"], "Date"],
                "NextYear": [r"\s+(ಮುಂದೆ|ಮುಂದಿನ|ಬರೋ|ಮುಂದಿನ್|ಬರು|ಬರುವ|ನೆಕ್ಸ್ಟ್|ಬರ್ತಿರೋ|1|ಒಂದು|ವನ್|ಒಂದ್)\s+(ವರ್ಷ|ವರ್ಷದ|ಇಯರ್)\s+(ಒಳಗೆ |ಒಳಗಡೆ |ಒಲ್ಗೇನೆ |ನಂತರ |ಆಮೇಲೆ |ಆದ್ಮೇಲೆ |ನಂತ್ರಾ |ಮೇಲೆ |ಮೇಲೇ |ಮತ್ತೆ |)", ["future_mod1"], "Year"],
                "NextXYear": [r"( ಮುಂದೆ| ಮುಂದಿನ| ಬರೋ| ಮುಂದಿನ್| ಬರು| ಬರುವ| ನೆಕ್ಸ್ಟ್| ಬರ್ತಿರೋ|)\s+(\d{1,2})\s+(ವರ್ಷ|ವರ್ಷದ|ಇಯರ್)\s+(ಒಳಗೆ |ಒಳಗಡೆ |ಒಲ್ಗೇನೆ |ನಂತರ |ಆಮೇಲೆ |ಆದ್ಮೇಲೆ |ನಂತ್ರಾ |ಮೇಲೆ |ಮೇಲೇ |ಮತ್ತೆ | ಗಳಲ್ಲಿ| ದಲ್ಲಿ|)", ["int"], "Year"],
            }

        if lang == "marathi":
            return {
                "DayToNext": [r"\s+(पुढल्या |पुढच्या |पुढील |नेक्स्ट |)\s+(\d{1,2})\s+(दिवस|दिवसा|दिवसाचा|दिवसांचा|दिवसाच्या|दिवसांच्या|दिवसां|दिवसात )\s*(नंतर|मधे|पहिले|आत|नी|ने|)\s+",["int", "mod"], "Day"],
                "IntervalDays": [r"\s+(\d{1,2} |)\s*(- |ते |या |आणि |)\s*(\d{1,2})\s+(दिवस|दिवसा|दिवसाचा|दिवसांचा|दिवसाच्या|दिवसांच्या|दिवसां)\s*(नंतर|मधे|पहिले|आत|त|नी|पर्येंत|पर्येन्त|पर्यंत|)\s+",["int", "mod"], "Day"],
                "DayToNext2": [r"\s+(\d{1,2} |)\s*(- |ते |या |आणि |)\s*(\d{1,2})\s+(दिवस|दिवसा|दिवसाचा|दिवसांचा|दिवसाच्या|दिवसांच्या|दिवसां)\s*(ने|नंतर|मधे|मध्ये|पहिले|आत|त|नी|पर्येंत|पर्येन्त|पर्यंत|)\s+",["int", "mod"], "Day"],
                "DayToNext3": [r"\s+(\d{1,2} |)\s*(- |ते |या |आणि |)\s*(\d{1,2})\s+(दिवस|दिवसा|दिवसां)\s*(चा)\s+(वेळ)\s+",["int", "mod"], "Day"],
                "DateFill1": [r"\s+(\d{1,2})\s+(तारीख|तारखे|जनवरी|जानेवारी|january|फरवरी|फेब्रुअरी|february|मार्च|march|अप्रैल|एप्रिल|april|मई|मे|may|जून|june|जुलाय|जुलाई|july|अगस्त|ऑगस्ट|august|सितम्बर|सितंबर|सेप्टेंबर|सप्टेंबर|सेप्टेम्बर|सेप्तेम्बर|सेप्टैंबर|september|अक्टूबर|ऑक्टोबर|october|नवंबर|नोव्हेंबर|november|दिसंबर|डिसेंबर|december)\s*( \d{4} |)\s*(ला |पर्येंत |पर्येन्त |पर्यंत |च्या पहले |)\s*", ["int", "month", "year"], "Date"],
                "DateFill2": [r"\s+(जनवरी|जानेवारी|january|फरवरी|फेब्रुअरी|february|मार्च|march|अप्रैल|एप्रिल|april|मई|मे|may|जून|june|जुलाय|जुलाई|july|अगस्त|ऑगस्ट|august|सितम्बर|सितंबर|सेप्टेंबर|सप्टेंबर|सेप्टेम्बर|सेप्तेम्बर|सेप्टैंबर|september|अक्टूबर|ऑक्टोबर|october|नवंबर|नोव्हेंबर|november|दिसंबर|डिसेंबर|december)\s+(\d{4} |)\s*(तारीख |तारखे |)\s*(ला |पर्येंत |पर्येन्त |पर्यंत |च्या पहले |)\s*", ["int", "month"], "Date"],
                "DateFill3": [r"\s+(जनवरी|जानेवारी|january|फरवरी|फेब्रुअरी|february|मार्च|march|अप्रैल|एप्रिल|april|मई|मे|may|जून|june|जुलाय|जुलाई|july|अगस्त|ऑगस्ट|august|सितम्बर|सितंबर|सेप्टेंबर|सप्टेंबर|सेप्टेम्बर|सेप्तेम्बर|सेप्टैंबर|september|अक्टूबर|ऑक्टोबर|october|नवंबर|नोव्हेंबर|november|दिसंबर|डिसेंबर|december)\s*(एंड|लास्ट|एंडिंग|शेवट)\s*(पर्यंत |)\s*(\d{1,2} |)\s*", ["int", "month", "end"], "Date"],
                "DateFill4": [r"\s+(\d{1,2})\s+(ला|पर्येंत|पर्येन्त|पर्यंत|च्या पहले|च्या पहिले|नंतर)\s+", ["int"], "Date"],
                "DateFill5": [r"\s+(\d{1,2} |)\s*(- |ते |या |आणि |)\s*(\d{1,2})\s+(तारीख|डेट|तिथि|दिनांक)\s+(पर्येंत |पर्येन्त |पर्यंत |च्या पहले |च्या पहिले |मध्ये |ला |)\s*", ["int"], "Date"],
                "DateMonthEnd": [r"\s+(ह्या |या |)\s*(मंथ|महीने|माह|महीना)\s*( च्या| चा|)\s+(एंड |आखिर |लास्ट |)\s*(पर्येंत |पर्येन्त |पर्यंत |ला |मधे |)\s*(\d{1,2} |)\s*", ["future_mod0", "int", "end"], "Month"],
                "DateNextMonthStart": [r"\s+(पुढच्या|पुढचा|नेक्स्ट)\s+(मंथ|महीना|महिन्यात|महिन्यामध्ये|महिन्याच्या|महिन्याचा)\s+(मध्ये |मधे |)\s*(\d{1,2} |)", ["future_mod1", "int"], "Month"],
                "DateNextMonthEnd": [r"\s+(पुढच्या|पुढचा|नेक्स्ट)\s+(मंथ|महीना|महिन्यात|महिन्यामध्ये|महिन्या)\s+(च्या |चा |)\s*(एंड|आखिर|लास्ट|एंडिंग|आखरी|शेवट|शेवटी)\s*(पर्येंत |पर्येन्त |पर्यंत |ला |)\s*", ["future_mod1", "int", "end"], "Month"],
                "DateXMonthEnd": [r"\s+(\d{1,2})\s+(मंथ|महीने|माह|महिन्या|महीना|महिन्यानंतर|महिन्यामध्ये)\s+(पर्येंत |पर्येन्त |पर्यंत |मधे |)\s*", ["int"], "Month"],
                "CurrentDate": [r"\s+(ताबडतोब|तुरंत|आता|आज|दुपारी)\s+(अच |च |)\s*", ["future_mod0"], "Day"],
                "CurrentEveningDate": [r"\s+(संध्याकाळ|सायंकाड|रात्री|नाईट|सकाड|सकाळी|मॉर्निंग|आफ्टरनून|दुपार|दुपारी)\s+(पर्येंत |पर्येन्त |पर्यंत |ला |मधे |)", ["future_mod0"], "Day"],
                "TomorrowDate": [r"\s+(उद्या|टुमारो|दुसऱ्या दिवशी|कल)\s*( संध्याकाळ| सायंकाड| रात्री| नाईट| सकाड| सकाळी| मॉर्निंग| आफ्टरनून| दुपार| दुपारी|)\s*(पर्येंत |पर्येन्त |पर्यंत |ला |मधे |)\s*", ["future_mod1"], "Day"],
                "DayAfterTomorrowDate": [r"\s+(परवा)\s*(संध्याकाळ|रात्री|सकाळी|दुपार|दुपारी|)\s+(पर्येंत |पर्येन्त |पर्यंत |ला |)", ["future_mod2"], "Day"],
                "NextWeek": [r"\s+(पुढल्या |पुढच्या |पुढील |नेक्स्ट |)\s*(हफ्त्या|हफ्त्यात|हफ्ता|वीक|सप्ताह|आठवड्यात|हप्त्यात|हप्त्यामध्ये)\s+(पर्येंत |पर्येन्त |पर्यंत |ला |मधे |मध्ये |)\s*", ["future_mod1", "mod"], "Week"],
                "NextXWeek": [r"\s+(पुढल्या |पुढच्या |पुढील |नेक्स्ट |)\s*(\d{1,2})\s+(हफ्त्या|हफ्ता|हप्ता|वीक|सप्ताह|हप्त्यामध्ये)\s+(पर्येंत |पर्येन्त |पर्यंत |ला |मधे |मध्ये |नंतर |)", ["int", "mod"], "Week"],
                "GetWeek": [r"\s+(पुढल्या |पुढच्या |पुढील |नेक्स्ट |)\s*(रविवार|रविवारी|संडे|sunday|सोमवार|सोमवारी|मंडे|monday|मंगळवार|मंगळवारी|ट्यूसडे|tuesday|बुधवार|बुधवारी|वेडनेसडे|wednesday|गुरुवार|गुरुवारी|थर्सडे|thursday|शुक्रवार|शुक्रवारी|फ्राइडे|friday|शनिवार|शनिवारी|सैटरडे|saturday)\s+(पर्येंत |पर्येन्त |पर्यंत |ला |)", ["future_mod1", "weekday"], "Week"],
                "LastWeekOfMonth": [r"\s+(एंड|आखिर|लास्ट|एंडिंग|आखरी|शेवट|शेवटी)\s+(हफ्ते|हफ्ता|हफ्त्या|वीक|सप्ताह)\s+(पर्येंत |पर्येन्त |पर्यंत |ला |मध्ये |मधे |)\s*", ["end"], "Date"],
                "NextYear": [r"\s+(पुढल्या|पुढच्या|पुढील|नेक्स्ट|1|एक|वन)\s+(वर्षा|ईयर|वर्षी)\s+(पर्येंत |पर्येन्त |पर्यंत |ला |नंतर |)", ["future_mod1"], "Year"],
                "NextXYear": [r"\s+(पुढल्या |पुढच्या |पुढील |नेक्स्ट | )\s*(\d{1,2})\s+(वर्षा|ईयर|वर्षी)\s+(पर्येंत |पर्येन्त |पर्यंत |ला |नंतर |)", ["int"], "Year"],
            }

        if lang == "telugu":
            return {
                "DayToNext": [r"\s*( ఇంకో| మోర్| నెక్స్ట్| వచ్చే| ఆఫ్టర్| ఇంకా| ఈ|)\s+(\d{1,2})\s*(రోజులు|రోజుల|రోజుల్లో|డేస్|దినాల్లో|రోజు|రోజులలో|రోజులకు|దినాల్లో|దినాల|డె|డే|నాడు|నాడే)\s+(తర్వాత |అయ్యాక |ముందు  |ముందర |మనువు |ముందుగానే |బిఫోర్ |అయినాక |అయినంక |లో |లోపు |ఆఫ్టర్ |వరకు |కల్లా |లోగా |లోపల |)\s*",["int", "mod"], "Day"],
                "IntervalDays": [r"\s+(\d{1,2} |)\s*(- |నుండి |లేదా |ఆర్ |)\s*(\d{1,2})\s+(రోజులు|రోజుల|రోజుల్లో|డేస్|రోజు|దినాల్లో|రోజులలో|రోజులకు|దినాల|డె|డే|నాడు|నాడే)\s+(తర్వాత |అయ్యాక |ముందు  |ముందర |మనువు |ముందుగానే |బిఫోర్ |అయినాక |అయినంక |లో |లోపు |ఆఫ్టర్ |వరకు |కల్లా |లోగా |లోపల |)\s*",["int", "mod"], "Day"],
                "DayToNext2": [r"\s+(\d{1,2} |)\s*(- |నుండి |లేదా |ఆర్ |)\s*(\d{1,2})\s+( రోజులు| రోజుల| రోజుల్లో| డేస్| రోజు| దినాల్లో| డేస్లో| దినాల| డె| డే| నాడు| నాడే|డేస్|రోజులలో|రోజులకు|డేస్లో)\s+(తర్వాత |అయ్యాక |ముందు  |ముందర |మనువు |ముందుగానే |బిఫోర్ |అయినాక |అయినంక |లో |లోపు |ఆఫ్టర్ |వరకు |కల్లా |లోగా |లోపల |)\s*",["int", "mod"], "Day"],
                "DayToNext3": [r"\s+(\d{1,2} |)\s*(- |నుండి |లేదా |ఆర్ |)\s*(\d{1,2})\s+(రోజులు|రోజుల|రోజుల్లో|రోజులలో|రోజులకు|డేస్|దినాల్లో|దినాల|రోజు|దినాల్లో|డె|డే)\s+(టైం|సమయం |గడువు |)\s*",["int", "mod"], "Day"],
                "DateFill1": [r"\s+(\d{1,2} |)\s*(- |నుండి |లేదా |ఆర్ |)\s*(\d{1,2})\s+(జనవరి|ఫిబ్రవరి|ఫెబ్రవరీ|మార్చి|మార్చ్|ఏప్రిల్|ఏప్రల్|మే|జూన్|జులై|ఆగష్టు|ఆగస్టు|సెప్టెంబర్|అక్టోబర్|నవంబర్|నవెంబర్|డిసెంబర్)\s+(\d{4} |)\s*( కి|)\s*(న |వరకు |ముందు |ముందే |లోపు |లోపే |రోజు|రోజున |లోగా |నాడు |నాడే |కల్లా |లోపల |)\s*", ["int", "month", "year"], "Date"],
                "DateFill2": [r"\s+(జనవరి|ఫిబ్రవరి|ఫెబ్రవరీ|మార్చి|మార్చ్|ఏప్రిల్|ఏప్రల్|మే|జూన్|జులై|ఆగష్టు|ఆగస్టు|సెప్టెంబర్|అక్టోబర్|నవంబర్|నవెంబర్|డిసెంబర్)\s+(\d{1,2} |)\s*(కి |తారీకు |డేట్ |రోజు |)\s*(న |కి |వరకు |ముందు |ముందే |లోపు |లోపే |రోజు |రోజున |లోగా |నాడు |నాడే |కల్లా |లోపల |)\s*", ["int", "month"], "Date"],
                "DateFill3": [r"\s+(జనవరి|ఫిబ్రవరి|ఫెబ్రవరీ|మార్చి|మార్చ్|ఏప్రిల్|ఏప్రల్|మే|జూన్|జులై|ఆగష్టు|ఆగస్టు|సెప్టెంబర్|అక్టోబర్|నవంబర్|నవెంబర్|డిసెంబర్)\s+(ఆఖరున|ఎండ్|చివరినాటికి|చివరికి|ఆఖరులోగా|ఆఖరులో|చివరిలో|చివరన|లాస్ట్|ఆఖర్లో|ఎండింగ్)\s*(తర్వాత |అయ్యాక |అయినాక |అయినంక |లో |లోపు |ఆఫ్టర్ |వరకు |కల్లా |లోపల |)\s*(\d{1,2} |)", ["int", "month", "end"], "Date"],
                "DateFill4": [r"\s+(\d{1,2} |)\s*(- |నుండి |లేదా |ఆర్ |)\s*(\d{1,2})\s+(తర్వాత|అయ్యాక|అయినాక|అయినంక|లో|లోపు|ఆఫ్టర్|వరకు|కల్లా|లోపల)", ["int"], "Date"],
                "DateFill5": [r"\s+(\d{1,2} |)\s*(- |నుండి |లేదా |ఆర్ |)\s*(\d{1,2})\s+(కి|తారీకు|తారీక్కు|డేట్|తేదీ|తారీఖు|తారీఖున)\s*(న | వరకు | ముందు | ముందే |లోపు | లోపు|లోపే | రోజు | రోజున |లోగా | నాడు | నాడే |)\s*", ["int"], "Date"],
                "DateMonthEnd": [r"\s*(ఈ|బై|దిస్|)\s*(నెల| నెల| నెల |మంత్ |మంత్ |నెలా| నెలా| మంత్| మంత్ | నెలాఖరున | నెలాఖరుకి | నెలాఖరులో)\s*(ఆఖరున|ఎండ్|చివరినాటికి|చివరికి|ఆఖరులోగా|ఆఖరులో|చివరిలో|లాస్ట్|చివరన|ఆఖర్లో|ఎండింగ్|)\s+(\d{1,2} |)", ["future_mod0", "int", "end"], "Month"],
                "DateNextMonthStart": [r"\s*( వచ్చే| తర్వాత| నెక్స్ట్)\s*(నెల|మంత్)\s+(\d{1,2} |)\s*", ["future_mod1", "int"], "Month"],
                "DateNextMonthEnd": [r"\s*( వచ్చే| తర్వాత| నెక్స్ట్)\s*(నెల|మంత్)\s+(చివరి|చివరికి|ఎండ్|ఆఖరి|ఆఖరికి|లాస్ట్|ఎండింగ్)\s+(తర్వాత |అయ్యాక |అయినాక |అయినంక |లో |లోపు |ఆఫ్టర్ |వరకు |కల్లా |లోపల |)\s*", ["future_mod1", "int", "end"], "Month"],
                "DateXMonthEnd": [r"\s+(\d{1,2})\s+(నెల|మంత్|నెలల|నెలల్లో|నెలలు|మంత్స్|నెల్ల)\s+(తర్వాత |అయ్యాక |అయినాక |అయినంక |లో |లోపు |ఆఫ్టర్ |వరకు |లోగా |కల్లా |ఆఖర్లో |)\s*", ["int"], "Month"],
                "CurrentDate": [r"\s*(ఈ|బై|)\s+(వెంటనే|ఇప్పుడే|ఇప్పుడు|ఈ రోజు|ఈరోజు|టుడే|ఈరోజే|ఇమ్మీడియేటగా|తక్షణమే|క్షణం|క్షణమే|క్షణంలో|ఇవాళ|ఈ రోజే|ఈనాడు|ఈనాడే|eenadu|ఈ రోజున)\s+(లో |లోపు |లోపల |వరకు |కల్లా |)\s*", ["future_mod0"], "Day"],
                "CurrentEveningDate": [r"\s+(పొద్దున|ఉదయం|ఉదయాన్నే|ప్రొద్దున|మార్నింగ్|మధ్యాహ్నం|మద్యానం|పగటీలి|సాయంత్రం|ఆఫ్టేర్నూన్|ఆఫ్టర్ నూన్|ఈవెనింగ్|ఈవినింగ్|సాయంకాలం|రాత్రి|నైట్|చీకటి)\s*(తర్వాత|అయ్యాక |అయినాక |అయినంక |లో |లోపు |ఆఫ్టర్ |వరకు |కల్లా |)\s+", ["future_mod0"], "Day"],   
                "TomorrowDate": [r"\s+(రేపు|టుమారో|మరుసటి రోజు|మరో రోజు|నెక్స్ట్ డే|రేపటి|రేపటిలోగా|రేపటికల్లా|రేపే|వన్డే|వన్ డే|ఒకరోజు|రేపటికి)\s+(పొద్దున|ఉదయం|ఉదయాన్నే|ప్రొద్దున|మార్నింగ్|మధ్యాహ్నం|మద్యానం|పగటీలి|సాయంత్రం|ఆఫ్టేర్నూన్|ఆఫ్టర్ నూన్|ఈవెనింగ్|సాయంకాలం|రాత్రి|నైట్|చీకటి|)\s*( తర్వాత | అయ్యాక | అయినాక | అయినంక | లో | లోపు | ఆఫ్టర్ | వరకు | కల్లా |)\s*", ["future_mod1"], "Day"],
                "DayAfterTomorrowDate": [r"\s+(ఎల్లుండి|డే ఆఫ్టర్ టుమారో|ఎల్లుండు)\s+(పొద్దున |ఉదయం |ఉదయాన్నే |ప్రొద్దున |మార్నింగ్ |మధ్యాహ్నం |మద్యానం |పగటీలి |సాయంత్రం |ఆఫ్టేర్నూన్ |ఆఫ్టర్ నూన్ |ఈవెనింగ్ |సాయంకాలం |రాత్రి |నైట్ |చీకటి |)(తర్వాత |అయ్యాక |అయినాక |అయినంక |లో |లోపు |ఆఫ్టర్ |వరకు |కల్లా |)\s*", ["future_mod2"], "Day"],
                "NextWeek": [r"\s*( వచ్చే| తర్వాత| నెక్స్ట్| 1| ఒక్క| ఒక| వన్|)\s*(వారం|వారము|వారంలో|వీక్| వారం| వారము| వారంలో| వీక్)\s+(తర్వాత |ముందు  |కంటే  ముందు  |ముందర |మనువు |ముందుగానే |బిఫోర్ |అయ్యాక |అయినాక |అయినంక |లో |లోపు |ఆఫ్టర్ |వరకు |కల్లా |లోపల |)\s*", ["future_mod1", "mod"], "Week"],
                "NextXWeek": [r"\s*( వచ్చే| తర్వాత| నెక్స్ట్| ఆఫ్టర్|)\s+(\d{1,2})\s+(వారం|వారము|వీక్|వారాల|వీక్స్|వారాలలో|వారంలో|వారాల్లో)\s+(తర్వాత |ముందు  |కంటే  ముందు  |ముందర |మనువు |ముందుగానే |బిఫోర్ |అయ్యాక |అయినాక |అయినంక |లో |లోపు |ఆఫ్టర్ |వరకు |కల్లా |లోపల |)\s*", ["int", "mod"], "Week"],
                "GetWeek": [r"\s*( వచ్చే| తర్వాత| నెక్స్ట్| ఆఫ్టర్|)\s+(సోమవారం|మంగళవారం|బుధవారం|గురువారం|శుక్రవారం|శనివారం|ఆదివారం|బేస్తవారం|బేస్తరం|సోమారం|మంగళారం|బుధారం|శుక్రారం|షెనారం|శేనారం|శెనివారం|సండే|మండే|ట్యూస్డే|వెడ్నెస్డే|వెనెస్డే|ఫ్రైడే|సాటర్డే)\s+(తర్వాత |అయ్యాక |అయినాక |అయినంక |లో |లోపు |ఆఫ్టర్ |వరకు |కల్లా |)\s*", ["future_mod1", "weekday"], "Week"],
                "LastWeekOfMonth": [r"\s+(చివరి|ఎండ్|ఆఖరి|లాస్ట్|ఎండింగ్)\s*(వారం|వారము|వారంలో|వీక్| వారం| వారము| వారంలో| వీక్)\s+(తర్వాత |అయ్యాక |అయినాక |అయినంక |లో |లోపు |ఆఫ్టర్ |వరకు |కల్లా |లోపల |)\s*", ["end"], "Date"],
                "NextYear": [r"\s*( వచ్చే| తర్వాత| నెక్స్ట్| 1| ఒక్క| ఒక| వన్|)\s+(సంవత్సరం|ఇయర్)\s+(తర్వాత |అయ్యాక |అయినాక |అయినంక |లో |లోపు |ఆఫ్టర్ |వరకు |కల్లా |లోపల |)\s*", ["future_mod1"], "Year"],             
                "NextXYear": [r"\s*( వచ్చే| తర్వాత| నెక్స్ట్| ఆఫ్టర్|)\s+(\d{1,2})\s+(సంవత్సరం|ఇయర్|సంవత్సరాల|సంవత్సరాలు|సంవత్సరాలల్లో|ఇయర్స్)\s+(తర్వాత |అయ్యాక |అయినాక |అయినంక |లో |లోపు |ఆఫ్టర్ |వరకు |కల్లా |లోపల |)\s*", ["int"], "Year"],
            }
        
        if lang == "malayalam":
            return {
                "DayToNext": [r"\s+(അടുത്ത |നെക്സ്റ്റ് |)\s*(\d{1,2})\s+(ദിവസം|ദിവസങ്ങൾ|ഡേ|ഡേയ്സ്|ദിവസ)\s*(തിന്|ന്|തിനു|ക്ക്|ത്തിനു|)\s*(ഉള്ളിൽ|കഴിഞ്ഞു|കഴിഞ്ഞേ|കഴിഞ്ഞ്|ശേഷം|ബിഫോർ|ആഫ്റ്റർ|ള്ളിൽ|മുമ്പ്|മുന്നേ|മുൻബ്|)\s*",["int", "mod"], "Day"],
                "IntervalDays": [r"\s+(\d{1,2} |)\s*(- |മുതൽ |നിന്നു |നിന്ന് |തുടങ്ങി |)\s*(\d{1,2})\s+(ദിവസം|ദിവസങ്ങൾ|ഡേ|ഡേയ്സ്)(തിന്|ന്|തിനു|ക്ക്|)\s*(ശേഷം |വരെ |ഉള്ളിൽ |കഴിഞ്ഞു |കഴിഞ്ഞേ |കഴിഞ്ഞ് |ബിഫോർ |ആഫ്റ്റർ |ള്ളിൽ |മുമ്പ് |മുന്നേ |മുൻബ്|)\s*",["int", "mod"], "Day"],
                "DayToNext2": [r"\s+(\d{1,2} |)\s*(- |മുതൽ |നിന്നു |നിന്ന് |തുടങ്ങി |)\s*(\d{1,2})\s+(ദിവസം |ദിവസ|ദിവസങ്ങൾ|ഡേ |ഡേയ്സ് )\s*(തിന്|ന്|തിനു|ത്തിനു|ക്ക്)\s*(ഉള്ളിൽ |ള്ളിൽ |കഴിഞ്ഞിട്ട് |കഴിഞ്ഞു |കഴിഞ്ഞേ |കഴിഞ്ഞ് |ശേഷം |ബിഫോർ |ആഫ്റ്റർ |മുമ്പ് |മുന്നേ |മുൻബ് |)\s*",["int", "mod"], "Day"],
                "DayToNext3": [r"\s+(\d{1,2} |)\s*(- |മുതൽ |നിന്നു |നിന്ന് |തുടങ്ങി |)\s*(\d{1,2})\s+(ദിവസത്തെ|ദിവസത്തിനകം|ദിവസം|ദിവസങ്ങൾ|ഡേ |ഡേയ്സ് )\s*(സമയം|)\s*",["int", "mod"], "Day"],
                "DateFill1": [r"\s+(\d{1,2} |)\s*(- |മുതൽ |നിന്നു |നിന്ന് |തുടങ്ങി |)\s*(\d{1,2})\s+(ജനുവരി|ഫെബ്രുവരി|മാർച്ച്|ഏപ്രിൽ|മെയ്|ജൂൺ|ജൂലൈ|ഓഗസ്റ്റ്|സെപ്റ്റംബർ|ഒക്ടോബർ|നവംബർ|ഡിസംബർ)(ന്|ക്ക്|)\s+(ഉള്ളിൽ |വരെ |)\s*", ["int", "month", "year"], "Date"],
                "DateFill2": [r"\s+(ജനുവരി|ഫെബ്രുവരി|മാർച്ച്|ഏപ്രിൽ|മെയ്|ജൂൺ|ജൂലൈ|ഓഗസ്റ്റ്|സെപ്റ്റംബർ|ഒക്ടോബർ|നവംബർ|ഡിസംബർ)\s+(\d{1,2} |)\s*(തീയതി|തീയതിക്ക്|തിയതിക്ക് |)\s*(മുമ്പ് |ശേഷം |)\s*", ["int", "month"], "Date"],
                "DateFill3": [r"\s+(ജനുവരി|ഫെബ്രുവരി|മാർച്ച്|ഏപ്രിൽ|മെയ്|ജൂൺ|ജൂലൈ|ഓഗസ്റ്റ്|സെപ്റ്റംബർ|ഒക്ടോബർ|നവംബർ|ഡിസംബർ)\s*(അവസാനം |വസാനം |ഏൻഡ് |ലാസ്റ്റ് |)\s*(\d{1,2} |)\s*", ["int", "month", "end"], "Date"],
                "DateFill4": [r"\s+(\d{1,2} |)\s*(- |മുതൽ |നിന്നു |നിന്ന് |തുടങ്ങി |)\s*(\d{1,2})\s+(ന്|തിയതി|തിയതിക്ക്|തീയതി|തീയതിക്ക്|ഡേറ്റ്)\s*(മുമ്പ് |വരെ |വരേക്കും |മുൻപ്|)\s+", ["int"], "Date"],
                "DateFill5": [r"\s+(\d{1,2} |)\s*(- |മുതൽ |നിന്നു |നിന്ന് |തുടങ്ങി |)\s*(\d{1,2})\s+(തിയതി|തിയതിക്ക്|തീയതി|തീയതിക്ക്|ഡേറ്റ്)\s+", ["int"], "Date"],
                "DateMonthEnd": [r"\s*(ഇ |ഈ |ദിസ് |)\s*(മാസ|മാസം|മാസാ|മന്ത്|മാസത്തേ|മാസത്തിൽ|മാസത്തിന്റെ)\s*(അവസാനം |വസാനം |ഏൻഡ് |ലാസ്റ്റ് |)\s*(\d{1,2} |)\s*", ["future_mod0", "int", "end"], "Month"],
                "DateNextMonthStart": [r"\s+(അടുത്ത |നെക്സ്റ്റ് |)\s*(മാസ|മാസാ|മാസം|മന്ത്|മാസത്തേ|മാസത്തിൽ|മാസത്തിന്റെ)\s*(\d{1,2} |)\s*", ["future_mod1", "int"], "Month"],
                "DateNextMonthEnd": [r"\s+(അടുത്ത|നെക്സ്റ്റ്)(മാസ|മാസാ|മാസത്തിന്റെ|മാസം|മന്ത്|മാസത്തേ|മാസത്തിൽ)\s*(അവസാനം |വസാനം |ഏൻഡ് |ലാസ്റ്റ് |)\s*(\d{1,2} |)\s*", ["future_mod1", "int", "end"], "Month"],
                "DateXMonthEnd": [r"\s+(\d{1,2})\s*(മാസം|മന്ത്|മാസത്തേ|മാസത്തിൽ|മാസത്തിന്)\s*(ഉള്ളിൽ |ത്തിനുള്ളിൽ |വരെ |കൊണ്ട് |)\s*", ["int"], "Month"],
                "CurrentDate": [r"\s+(ഇന്ന്|ടുഡേ|ഇപ്പോൾ|ഇപ്പോള്|നൗ|ഇപ്പം|ഇന്നത്തെ)\s*(തന്നെ |)\s*", ["future_mod0"], "Day"],
                "CurrentEveningDate": [r"\s+(ഇന്ന്|ടുഡേ)\s*(രാത്രി|നൈറ്റ് |വൈകിട്ട് |വൈകുന്നേരം |സന്ധ്യ|എവെനിംഗ് |ഉച്ച|ഉച്ചക്ക്|ഉച്ചകഴിഞ്ഞ് |അഫ്റെർൂൺ |രാവിലെ|മോണിങ് |പുലർച്ചെ|പുലര്വേള|പുലർവേള)\s*(തന്നെ |ഉള്ളിൽ |)\s*", ["future_mod0"], "Day"],
                "TomorrowDate": [r"\s+(നാളെ|ടോമോരരൗ|നാളത്തെ|നാളത്തേ|നാളേ)\s+(രാത്രി|നൈറ്റ് |വൈകിട്ട് |വൈകുന്നേരം |സന്ധ്യ|എവെനിംഗ് |ഉച്ച|ഉച്ചക്ക്|ഉച്ചകഴിഞ്ഞ് |അഫ്റെർൂൺ |രാവിലെ|മോണിങ് |പുലർച്ചെ|പുലര്വേള|പുലർവേള|)\s*(തന്നെ |ക്ക് |ത്തന്നെ |ഉള്ളിൽ |)\s*", ["future_mod1"], "Day"],
                "DayAfterTomorrowDate": [r"\s+(മറ്റന്നാൾ|മറ്റന്നാള്|ഡേ ആഫ്റ്റർ ടോമോരരൗ)\s+(രാത്രി |നൈറ്റ് |വൈകിട്ട് |വൈകുന്നേരം |സന്ധ്യ |എവെനിംഗ് |ഉച്ച|ഉച്ചക്ക്|ഉച്ചകഴിഞ്ഞ് |അഫ്റെർൂൺ |രാവിലെ |മോണിങ് |പുലർച്ചെ |പുലര്വേള|പുലർവേള|)\s*(തന്നെ |ഉള്ളിൽ |)\s*", ["future_mod2"], "Day"],
                "NextWeek": [r"\s*(അടുത്ത |അടുത്താ|നെക്സ്റ്റ് |ഒന്ന് |ആദ്യം |ഒന്നു |ഈയാ|ഒരാ|ഫസ്റ്റ് |ഒന്നാം |വൺ |)\s*(ആഴ്ച|ഴ്ച|ഴ്ചക്ക്|വീക്ക്)\s*(തന്നെ |ഉള്ളിൽ |ള്ളിൽ |കഴിഞ്ഞിട്ട് |കഴിഞ്ഞു |കഴിഞ്ഞേ |കഴിഞ്ഞ് |ശേഷം |ബിഫോർ |ആഫ്റ്റർ |മുമ്പ് |മുന്നേ |മുൻബ് |)\s*", ["future_mod1", "mod"], "Week"],
                "NextXWeek": [r"\s+(അടുത്ത |നെക്സ്റ്റ് |)\s*(\d{1,2})\s+(ആഴ്ച|വീക്ക്)\s*(തന്നെ |ഉള്ളിൽ |ള്ളിൽ |കഴിഞ്ഞിട്ട് |കഴിഞ്ഞു |കഴിഞ്ഞേ |കഴിഞ്ഞ് |ശേഷം |ബിഫോർ |ആഫ്റ്റർ |മുമ്പ് |മുന്നേ |മുൻബ് |)\s*", ["int", "mod"], "Week"],
                "GetWeek": [r"\s+(അടുത്ത |നെക്സ്റ്റ് |)\s*(തിങ്കൾ|തിങ്കളാഴ്ച|മോണ്ടായ് |ചൊവ്വ|ചൊവ്വാഴ്ച|ടുസ്‌ഡേ |ബുധൻ|ബുധനാഴ്ച|വെഡ്നെസ്‌ഡേ |വ്യാഴം|വ്യാഴാഴ്ച|തുര്സ്ടായ് |വെള്ളി|വെള്ളിയാഴ്ച|ഫ്രൈഡേ |ശനി|ശനിയാഴ്ച|സടുർദായ് |ഞായർ|ഞായറാഴ്ച|സൺ‌ഡേ )\s*(ന്|നു|ക്ക്|)\s*(ഉള്ളിൽ |വരെ |)\s*", ["future_mod1", "weekday"], "Week"],
                "LastWeekOfMonth": [r"\s+(അവസാനം |ഏൻഡ് |ലാസ്റ്റ് |)\s*(ആഴ്ച|ആഴ്ചയ്ക്ക്|വീക്ക്|വീക്കിന്)\s+(ഉള്ളിൽ |വരെ |)\s*", ["end"], "Date"],
                "NextYear": [r"\s*(നെക്സ്റ്റ് |അടുത്ത|ഒന്ന്|ആദ്യം|ഒന്നു|ഒരു|ഫസ്റ്റ് |ഒന്നാം|വൺ )\s*(കൊല്ല|ഇയർ |വർഷം |വര്ഷ|)\s*(തിന്|ത്തിന്|ന്|തിനു|ത്തിനു|ന്ന്|ല്|ൽ|ഇൽ|ഇല്)\s*(മുമ്പ് |ശേഷം |)\s*", ["future_mod1"], "Year"],
                "NextXYear": [r"\s+(\d{1,2})\s+(കൊല്ല|ഇയർ |വര്ഷ|വർഷ|)\s*(തിന്|ത്തിന്|ന്|തിനു|ത്തിനു)\s*(മുമ്പ് |ശേഷം |)\s*", ["int"], "Year"],
            }
    
        if lang == "bengali":
            return {
                "DayToNext": [r"( পরের| সামনের| নেক্সট|)\s+(\d{1,2})\s*(দিন|দিনের|ডেস|ডে|ডেজ)\s+(পরে|পর |)\s*(মধ্যে |ভিতর |ভিতরে |বাদে |বাদ |)\s*",["int", "mod"], "Day"],
                "IntervalDays": [r"\s+(\d{1,2} |)\s*(- |থেকে |বা |অথবা |অর |)\s*(\d{1,2})\s+(দিন|দিনের|ডেস|ডে|ডেজ)\s+(পরে |পর |)\s*(মধ্যে |ভিতর | ভিতরে |বাদে |বাদ |)",["int", "mod"], "Day"],
                "DayToNext2": [r"\s+(\d{1,2} |)\s*(- |থেকে |অথবা |অর |বা |)\s*(\d{1,2})\s*(দিন|দিনের|ডেস|ডে|ডেজ)\s+(এর |)\s*(বাদ|বাদে|পর|মধ্যে|ভিতর|পরে|ভিতরে|)\s*",["int", "mod"], "Day"],
                "DayToNext3": [r"\s+(\d{1,2} |)\s*(- |থেকে |অথবা |অর |বা |)\s*(\d{1,2})\s*(দিন|দিনের|ডেস|ডে|ডেজ)\s+(এর |)\s*(সময়|টাইম)\s+",["int", "mod"], "Day"],
                "DateFill1": [r"\s+(\d{1,2} |)\s*(- |থেকে |অথবা |অর |বা |)\s*(\d{1,2})\s+(জানুয়ারি|জানুয়ারী|জানুয়ারির|জানুয়ারীর|january|ফেব্রুয়ারী|ফেবরারী|ফেব্রুয়ারীর|ফেবরারীর|february|মার্চ|মার্চে|মার্চের|march|এপ্রিল|এপ্রিলে|এপ্রিলের|april|মে|মের|May|জুন|জুনে|জুনের|june|জুলাই|জুলাইএ|জুলাইএর|july|আগস্ট|অগাষ্ট |অগাস্টে |আগস্টে|অগাস্টের |আগস্টের|august|সেপ্টেম্বর|সেপটেমবার|সেপ্টেম্বার|সেপ্টেম্বরের|সেপটেমবারের|সেপ্টেম্বারের|september|অক্টোবর|ওকটোবার|অক্টোবার|অক্টোবরের|ওকটোবারের|অক্টোবারের|october|নভেম্বর|ণবেম্বর|নভেম্বার|নভেম্বরের|ণবেম্বরের|নভেম্বারের|november|ডিসেম্বর|ডিসেম্বার|ডিসেম্বরের|ডিসেম্বারের|december)\s+(তে |এ |\d{4} |)\s*(তে |এ |এর আগে |এর মধ্যে |পর্যন্ত |এর ভিতর |এর ভেতরে |এর ভিতরে |পর |পরে |)\s*", ["int", "month", "year"], "Date"],
                "DateFill2": [r"\s+(জানুয়ারি|ফেব্রুয়ারী|ফেবরারী|মার্চ|এপ্রিল|মে|জুন|জুলাই|আগস্ট|অগাষ্ট|সেপ্টেম্বর|অক্টোবর|নভেম্বর|ডিসেম্বর)\s+(\d{1,2} |)\s*(তারিখ|তারিখের|তারিখে |)\s*(এ |এর আগে |এর মধ্যে |পর্যন্ত |এর ভিতর |এর ভেতরে |এর ভিতরে |পর |পরে |)", ["int", "month"], "Date"],
                "DateFill3": [r"(জানুয়ারি|জানুয়ারী|জানুয়ারির|জানুয়ারীর|january|ফেব্রুয়ারী|ফেবরারী|ফেব্রুয়ারীর|ফেবরারীর|february|মার্চ|মার্চে|মার্চের|march|এপ্রিল|এপ্রিলে|এপ্রিলের|april|মে|মের|may|জুন|জুনে|জুনের|june|জুলাই|জুলাইএ|জুলাইএর|july|আগস্ট|অগাষ্ট |অগাস্টে |আগস্টে|অগাস্টের |আগস্টের|august|সেপ্টেম্বর|সেপটেমবার|সেপ্টেম্বার|সেপ্টেম্বরের|সেপটেমবারের|সেপ্টেম্বারের|september|অক্টোবর|ওকটোবার|অক্টোবার|অক্টোবরের|ওকটোবারের|অক্টোবারের|cctober|নভেম্বর|ণবেম্বর|নভেম্বার|নভেম্বরের|ণবেম্বরের|নভেম্বারের|november|ডিসেম্বর|ডিসেম্বার|ডিসেম্বরের|ডিসেম্বারের|december)\s+(এর |)\s*(লাস্ট|শেষ|লাস্টে|শেষে|এন্ডিংএ)\s*(পর্যন্ত |)\s*(\d{1,2} |)\s*", ["int", "month", "end"], "Date"],
                "DateFill4": [r"\s+(\d{1,2} |)\s*(- |থেকে |অথবা |অর |বা |)\s*(\d{1,2})\s*(এ| এর মধ্যে| এর আগে| এর পরে| তারিখ| তারিখে)\s+", ["int"], "Date"],
                "DateFill5": [r"\s+(\d{1,2} |)\s*(- |থেকে |অথবা |অর |বা |)\s*(\d{1,2})\s+(তারিখ|তারিখের|তারিখে)\s+(তে |এ | এর আগে |এর মধ্যে |পর্যন্ত |এর ভিতর |এর ভেতরে |এর ভিতরে |পর |পরে |)\s*", ["int"], "Date"],
                "DateMonthEnd": [r"\s+(এই |এ |দিস |)\s*(মাসের|মান্থ|মাস)\s+(এর |)\s*(এন্ড|শেষ|লাস্ট|শেষে |)\s*(এ | এর আগে |এর মধ্যে |পর্যন্ত |এর ভিতর |এর ভেতরে |এর ভিতরে |পর |পরে |)\s*(\d{1,2} |)\s*", ["future_mod0", "int", "end"], "Month"],
                "DateNextMonthStart": [r"\s+(সামনের|নেক্সট|পরের)\s+(মান্থ|মাস|মাসে|মাসের)\s*(এ | এর আগে |এর মধ্যে |পর্যন্ত |এর ভিতর |এর ভেতরে |এর ভিতরে |)\s*(\d{1,2} |)\s*", ["future_mod1", "int"], "Month"],
                "DateNextMonthEnd": [r"\s+(সামনের|নেক্সট|পরের)\s+(মান্থ|মাস|মাসে|মাসের)\s*(পরে|লাস্ট|শেষ|লাস্টে|শেষে|এন্ডিংএ)(পর্যন্ত |)\s*", ["future_mod1", "int", "end"], "Month"],
                "DateXMonthEnd": [r"\s+(\d{1,2})\s*( মান্থ।মাস। মাসে| মাসের)\s*(এ | এর আগে | এর মধ্যে | পর্যন্ত | এর ভিতর | এর ভেতরে | এর ভিতরে | পর | পরে |)\s*", ["int"], "Month"],
                "CurrentDate": [r"\s+(একটু পর|একটুপর|একটু পরে|একটু খুনী পর|কিছুক্ষণের মধ্যে|কিছুক্ষণ পর|কিছুক্ষণ পরে|কয়েকঘন্টার মধ্যে|কয়েক ঘন্টার মধ্যে|এক্ষুণি|এক্ষুণী|একখুনী|এক্ষুনী|এক্ষুনি|এখনই|একখুনি|এখুনি|আখনই|আখনী|আজ|আজই|আজকের|আজকেই|আজকে|টুডে|টুডেস|দুপুর)\s+", ["future_mod0"], "Day"],
                "CurrentEveningDate": [r"\s+(রাত|রাতে|রাত্রি|রাত্রিবেলা|নাইট|নাইটে|সকাল|সকালে|মর্নিং|মর্নিংয়ে|দুপুর|দুপুরে|দুপুরবেলা|বিকাল|বিকেল|বিকালবেলা|বিকেলবেলা|আফ্টারনূন)\s+(এ | এর আগে |এর মধ্যে |পর্যন্ত |এর ভিতর |এর ভেতরে |এর ভিতরে |পর |পরে |)\s*", ["future_mod0"], "Day"],
                "TomorrowDate": [r"\s+(আগামীকাল|আগামী কাল|আগামি কাল |আগামিকাল|আগামীকালের|আগামিকালের|আগামি কালের|আগামী কালের|কালকে|কালকেই|কালই|কালকের|কাল|টোমোরো|পরের দিন)\s*( রাত| রাতে| রাত্রি| রাত্রিবেলা| নাইট| নাইটে| সকাল| সকালে| মর্নিং| মর্নিংয়ে| দুপুর| দুপুরে| দুপুরবেলা| বিকাল| বিকেল| বিকালবেলা| বিকেলবেলা| আফ্টারনূন|)\s*( এ| এর আগে| এর মধ্যে| পর্যন্ত| এর ভিতর| এর ভেতরে| এর ভিতরে| পর| পরে|)\s*", ["future_mod1"], "Day"],
                "DayAfterTomorrowDate": [r"\s+(পরশু|পরশুদিন|পরশু দিন|পরসু দিন|পরসুদিন|পরসু|পশশু দিন|পশশুদিন|পশশু|পোসসু দিন|পোসসুদিন|পোসসু|পরসু দিন|পরসুদিন|পরসু|ডে আফ্টার টোমোরো)\s+(রাত |রাতে |রাত্রি |রাত্রিবেলা |নাইট |নাইটে |সকাল |সকালে |মর্নিং |মর্নিংয়ে |দুপুর |দুপুরে |দুপুরবেলা |বিকাল |বিকেল |বিকালবেলা |বিকেলবেলা |আফ্টারনূন |)\s*(এ | এর আগে |এর মধ্যে |পর্যন্ত |এর ভিতর |এর ভেতরে |এর ভিতরে |পর |পরে |)\s*", ["future_mod2"], "Day"],
                "NextWeek": [r"\s+(সামনের |নেক্সট |পরের |)\s*(সপ্তাহ|সপ্তা|উইক|সপ্তাহে|সপ্তায়|সপ্তাহ)\s+(এ | এর আগে |এর মধ্যে |পর্যন্ত |এর ভিতর |এর ভেতরে |এর ভিতরে |পর |পরে |)\s*", ["future_mod1", "mod"], "Week"],
                "NextXWeek": [r"\s+(সামনের |নেক্সট |পরের |)\s*(\d{1,2})\s+(সপ্তাহ|সপ্তা|উইক|সপ্তাহে|সপ্তায়|সপ্তাহ)\s+(এ| এর আগে |এর মধ্যে |পর্যন্ত |এর ভিতর |এর ভেতরে |এর ভিতরে |পর |পরে |)\s*", ["int", "mod"], "Week"],
                "GetWeek": [r"\s+(সামনের |নেক্সট |পরের |)\s*(রবিবার|রোববার|সানডে|সোমবার|মানডে|মন্ডে|মঙ্গলবার|টুয়েসডে|টিউসডে|বুধবার|ওয়েডনেসডে|বৃহস্পতিবার|থার্সডে|শুক্রবার|ফ্রাইডে|শনিবার|স্যাটারডে|সোমবারে|সমবার|সোম বার|মান্ডে|মঙ্গলবারে|মঙ্গল বার |মঙ্গোলবার|ট্য়ূসডে|টিউস ডে|বুধবারে|বূধবার|বূধ বার|ওয়েডনেস ডে|বৃহস্পতিবারে |বেশপতিবার|বৃহস্পতি বার|থার্স ডে|শুক্রবারে|শুক্কুরবার|শুক্র বার|জুম্মাবার|ফ্রাই ডে|শনিবারে|শনি বার|সোনিবার|শনীবার|শাটার ডে|শাটারডে|স্যাটার ডে|সাটার ডে|সাটারডে|রবিবারে|রোবিবার)\s+(এ| এর আগে |এর মধ্যে |পর্যন্ত |এর ভিতর |এর ভেতরে |এর ভিতরে |পর |পরে |)\s*", ["future_mod1", "weekday"], "Week"],
                "LastWeekOfMonth": [r"\s+(শেষ|শেষের|লাস্ট|এন্ডিং)\s+(সপ্তাহ| সপ্তা|উইক|সপ্তাহে|সপ্তায়|সপ্তাহ)\s+(এ| এর আগে |এর মধ্যে |পর্যন্ত |এর ভিতর |এর ভেতরে |এর ভিতরে |পর |পরে |)\s*", ["end"], "Date"],
                "NextYear": [r"\s+(সামনের|নেক্সট|পরের|1|এক|ওয়ান)\s+(সাল|ইয়ার)\s+(এ | এর আগে |এর মধ্যে |পর্যন্ত |এর ভিতর |এর ভেতরে |এর ভিতরে |পর |পরে |)\s*", ["future_mod1"], "Year"],
                "NextXYear": [r"\s*( সামনের| নেক্সট| পরের|)\s+(\d{1,2})\s+(সাল|ইয়ার)\s+(এ | এর আগে |এর মধ্যে |পর্যন্ত |এর ভিতর |এর ভেতরে |এর ভিতরে |পর |পরে |)\s*", ["int"], "Year"],
            }

        if lang == "tamil":
            return {
                "DayToNext": [r"\s+(அடுத்த |அடுத்து |நெக்ஸ்ட் |நெக்ஸ்ட்டு | மேலும்| இன்னொரு| இன்னும்)\s*(\d{1,2})\s+(நாட்கள்|நாள்|நாளில்|நாட்களில்|நாள்ல|நாட்கள்ல|நாளைல|டயஸ்|டே|நாளுக்கு|நாட்களுக்குள்|டேட்)\s+(பின் |பின்னர் |அப்புறம் |முன் |முன்னர் |முன்னரே |அப்றம் |பிறகு |ஆஃப்டர் |)\s*(உள்ள |குள்ள |ள்ள | ள்ளே|)",["int", "mod"], "Day"],
                "IntervalDays": [r"\s+(\d{1,2} |)\s*(- |அல்லது |மற்றும் |இல்லாட்டி |)\s*(\d{1,2})\s+(நாட்கள்|நாள்|நாள்ல|நாளில்|நாளைல|நாட்களில்|நாட்கள்ல|டே|டேஸ்|நாளுக்கு|நாட்களுக்குள்|டேட்)\s+(பின்னர்|பின்|முன்|முன்னர்|முன்னரே|அப்புறம்|அப்றம்|பிறகு|)\s*(ள்ள | ள்ளே |)\s*",["int", "mod"], "Day"],
                "DayToNext2": [r"\s+(\d{1,2} |)\s*(- |அல்லது |மற்றும் |இல்லாட்டி |)\s*(\d{1,2})\s+(நாட்கள்|நாள்|நாள்ல|நாட்கள்ல|நாளில்|நாட்களில்|நாளுக்கு|நாளைல|டேஸ்|டே|நாளுக்கு|நாட்களுக்குள்|டேட்)\s*(ல|)\s*(பின் |குள்ள |உள்ள |அப்றம் |அதற்குள் |அதற்குள்ளே |உள்ளே |அப்புறம் |அப்ரோ |)\s*",["int", "mod"], "Day"],
                "DayToNext3": [r"\s+(\d{1,2} |)\s*(- |அல்லது |மற்றும் |இல்லாட்டி |)\s*(\d{1,2})\s+(நாட்கள்|நாள்|நாள்ல|நாளில்|நாட்கள்|நாட்களில்|நாளைல|டேஸ்|டே|நாளுக்கு)\s*(பின்|குள்ள|உள்ள|அப்றம்|அப்ரோ|டைம்|)\s+",["int", "mod"], "Day"],
                "DateFill1": [r"\s+(\d{1,2} |)\s*(- |இல்ல |இல்லனா |அல்லது |மற்றும் |இல்லாட்டி |)\s*(\d{1,2})\s+(ஜனவரி|பிப்ரவரி|மார்ச்|ஏப்ரல்|மே|ஜூன்|ஜூலை|ஆகஸ்ட்|செப்டம்பர்|செப்டம்பர்|அக்டோபர்|நவம்பர்|டிசம்பர்)\s+(\d{4} |)\s*(முன் |வரை |முன்னாடியே |உள்ள |குள்ள |)\s*", ["int", "month", "year"], "Date"],
                "DateFill2": [r"\s+(ஜனவரி|பிப்ரவரி|மார்ச்|ஏப்ரல்|மே|ஜூன்|ஜூலை|ஆகஸ்ட்|செப்டம்பர்|செப்டம்பர்|அக்டோபர்|நவம்பர்|டிசம்பர்)\s+(\d{1,2} |)\s*(முன் |வரை |முன்னாடியே |உள்ள |குள்ள |)\s*", ["int", "month"], "Date"],
                "DateFill3": [r"\s+(ஜனவரி|பிப்ரவரி|மார்ச்|ஏப்ரல்|மே|ஜூன்|ஜூலை|ஆகஸ்ட்|செப்டம்பர்|செப்டம்பர்|அக்டோபர்|நவம்பர்|டிசம்பர்)\s+(கடைசி|லாஸ்ட்)\s*(ல |யா |)\s*([0-9]+ |)\s*", ["int", "month", "end"], "Date"],
                "DateFill4": [r"\s+(\d{1,2} |)\s*(- |இல்ல |இல்லனா |அல்லது |மற்றும் |இல்லாட்டி |)\s*(\d{1,2})\s*(ஆம் |ம் |)\s*(தேதி|தேதிக்கு|தேதிக்குள்)\s+(முன் |குள்ள |உள்ள |அன்னைக்கு |அப்போ |அப்ப |அன்று |ஆயிடும் |)\s*", ["int"], "Date"],
                "DateFill5": [r"\s+(\d{1,2} |)\s*(- |இல்ல |இல்லனா |அல்லது |மற்றும் |இல்லாட்டி |)\s*(\d{1,2})\s+(தேதி|தேதிக்கு|தேதிக்குள்)\s+(யில் |அப்போ |ஆயிடும் |)\s*", ["int"], "Date"],
                "DateMonthEnd": [r"\s+(இந்த |திஸ் |)\s*(மாதம்|மாசம்|மன்த்|மாதங்கள்|மாச|மாதத்திற்கு|மந்த்|மாசக்|மாதக்)\s+(ல |)\s*(கடைசி |லாஸ்ட் |எண்டு |கடைசில |)\s*(பின் |ஆயிடும் |ஆகிடும் |)\s*(\d{1,2} |)\s*", ["future_mod0", "int", "end"], "Month"],
                "DateNextMonthStart": [r"\s+(அடுத்து|அடுத்த|நெக்ஸ்ட்|நெக்ஸ்ட்டு|வர)\s+(மாதம்|மாசம்|மன்த்|மாச|மாதத்திற்கு|மாதங்கள்|மந்த்|மாசக்|மாதக்)\s*(ஆயிடும் |ஆகிடும் |ஆயிரும் |)\s*(\d{1,2} |)\s*", ["future_mod1", "int"], "Month"],
                "DateNextMonthEnd": [r"\s+(அடுத்து|அடுத்த|நெக்ஸ்ட்|நெக்ஸ்ட்டு|வர)\s+(மாதம்|மாசம்|மன்த்|மாச|மாதங்கள்|மாதத்திற்கு|மந்த்|மாசக்|மாதக்)\s*(ல |)\s*(கடைசி |லாஸ்ட் |எண்டு |கடைசில |)\s*(பின் |ஆயிடும் |ஆகிடும் |)\s*", ["future_mod1", "int", "end"], "Month"],
                "DateXMonthEnd": [r"\s+(\d{1,2})\s+(மாதம்|மாசம்|மன்த்|மாச|மாதத்திற்கு|மந்த்|மாசத்தில்|மாதங்கள்|மாதத்தில்|மன்த்ஸ்)\s+(பின்னர் |உள்ள |அப்புறம் |குள்ள |)\s*", ["int"], "Month"],
                "CurrentDate": [r"\s+(உடனடியாக|இப்போது|இப்போதே|இப்பவே|இப்பொழுதே|இப்பொழுது|இன்னிக்கி|இன்று|இப்போவே|இப்ப|இன்னைக்கு|இன்றைக்கு|இப்போ|இப்பவே|இன்னிக்கு|ரைட்நவ்|டுடே)\s+", ["future_mod0"], "Day"],
                "CurrentEveningDate": [r"\s+(மாலை|நைட்|நைட்டு|இரவு|ஈவினிங்|பிற்பகல்|சாய்ங்காலம்|சாயிந்திரம்)\s*(தான் |)\s*", ["future_mod0"], "Day"],
                "TomorrowDate": [r"\s+(நாளை|நாளைக்கு|டுமாரோ|மறுநாள்|நாளைய|ஒருநாள்|நாளைக்கி|நாளைக்கே|மறுநாளே)\s+(மாலை |இரவு |ஈவினிங் |பிற்பகல் |சாய்ங்காலம் |பிற்பகல் |நைட் |ராத்திரி |தினம் |)\s*", ["future_mod1"], "Day"],
                "DayAfterTomorrowDate": [r"\s+(நாளை மறுநாள்|நாளாநாளை|டே ஆஃப்டர்டுமொரோ|நாளான்னைக்கு|நாளான்னிக்கு)\s+(மாலை |இரவு |ஈவினிங் |பிற்பகல் |சாய்ங்காலம் |பிற்பகல் |நைட் |ராத்திரி |)\s*", ["future_mod2"], "Day"],
                "NextWeek": [r"\s+(அடுத்த |நெக்ஸ்ட் |வர |ஒரு |வரும் |இந்த |திஸ் |விதின் |)\s*(வாரம்|வீக்|வீக்ல|வாரத்திற்குள்|வாரத்தில்|வாரங்களில்|வாரத்திற்|வாரத்துக்கு)\s+(ள்ளே |ள்ள |உள்ள |உள்ளே |)\s*", ["future_mod1", "mod"], "Week"],
                "NextXWeek": [r"\s+(அடுத்து|அடுத்த |நெக்ஸ்ட் |நெக்ஸ்ட்டு |வர|)\s*(\d{1,2})\s+(வாரம்|வீக்|வீக்ல|வாரத்தில்|வாரங்களில்|வாரத்திற்|வாரத்துக்கு)\s+(ள்ளே |ள்ள |உள்ள |உள்ளே |)\s*", ["int", "mod"], "Week"],
                "GetWeek": [r"\s*( வரும்| அடுத்து| அடுத்த| நெக்ஸ்ட்| வர| இந்த| திஸ்|)\s+(மன்டே|மண்டே|திங்கள்கிழமை|திங்ககிழமை|திங்கட்கிழமை|திங்கள்|செவ்வாய்|செவ்வாய்க்கிழமை|ட்யூஸ்டே|புதன்|புதன்கிழமை|வெட்னஸ்டே|தர்ஸ்டே|வியாழன்|வியாழக்கிழமை|ஃப்ரைடே|வெள்ளி|வெள்ளிக்கிழமை|சாடர்டே|சாட்டர்டே|சனி|சனிக்கிழமை|சண்டே|ஞாயிற்றுக்கிழமை|ஞாயிறு)\s+", ["future_mod1", "weekday"], "Week"],
                "LastWeekOfMonth": [r"\s+(கடைசி|லாஸ்ட்)\s+(வாரம்|வீக்|வீக்ல|வாரத்தில்|வாரங்களில்)\s+(ஆயிடும் |ஆகிடும் |ஆயிரும் |)\s*", ["end"], "Date"],
                "NextYear": [r"\s+(அடுத்த|நெக்ஸ்ட்|நெக்ஸ்ட்டு|ஒரு)\s+(ஆண்டு|இயர்|வர்ஷம்|வருஷம்|வருடம்)\s+", ["future_mod1"], "Year"],
                "NextXYear": [r"\s+(நெக்ஸ்ட் |நெக்ஸ்ட்டு |அப்றம் |பின் |வர |)\s*(\d{1,2})\s+(ஆண்டு|இயர்|வர்ஷம்|வருஷம்|வருடம்)\s+(பின் |பிறகு |அப்புறம் |அப்றம் |)\s*", ["int"], "Year"],
            }

        if lang == "punjabi":
            return {
                "DayToNext": [r"\s+( ਅਗਲੇ| ਅਗਲਾ| ਨੇਕਸਟ|)\s*(\d{1,2})\s+(ਦਿਨ|ਦਿਨਾਂ|ਡੇਜ|ਡੇੇਜ਼਼|ਡੇੇ)\s+(ਬਾਅਦ |ਬਾਦ |ਮਗਰੋ |ਪਹਿਲਾਂ |ਪਹਿਲੇ |ਅੰਦਰ |)\s*(ਵਿਚ |ਵਿੱਚ |ਤਕ |ਤੱਕ |)\s*", ["int", "mod"], "Day"],
                "IntervalDays": [r"\s+(\d{1,2} |)\s*(- |ਤੋਂ |ਯਾ |ਜਾਂ |ਅਤੇ |ਤੇ |ਫਿਰ |)\s*(\d{1,2})\s+(ਦਿਨ|ਦਿਨਾਂ|ਡੇਜ|ਡੇੇਜ਼਼|ਡੇੇ)\s+(ਬਾਅਦ |ਬਾਦ |ਮਗਰੋ |ਪਹਿਲਾਂ |ਪਹਿਲੇ |ਅੰਦਰ |)\s*(ਵਿਚ |ਵਿੱਚ |ਤਕ |ਤੱਕ |)\s*", ["int", "mod"], "Day"],
                "DayToNext2": [r"\s+(\d{1,2} |)\s*(- |ਤੋਂ |ਯਾ |ਜਾਂ |ਅਤੇ |ਤੇ |ਫਿਰ |)\s*(\d{1,2})\s+(ਦਿਨ|ਦਿਨਾਂ|ਡੇਜ|ਡੇੇਜ਼਼|ਡੇੇ)\s+(ਦੇ |)\s*(ਬਾਅਦ |ਬਾਦ |ਮਗਰੋ|ਪਹਿਲਾਂ|ਪਹਿਲੇ |)\s+", ["int", "mod"], "Day"],
                "DayToNext3": [r"\s+(\d{1,2} |)\s*(- |ਤੋਂ |ਯਾ |ਜਾਂ |ਅਤੇ |ਤੇ |ਫਿਰ |)\s*(\d{1,2})\s+(ਦਿਨ|ਦਿਨਾਂ|ਡੇਜ|ਡੇੇਜ਼਼|ਡੇੇ)\s+(ਦਾ |)\s*(ਸਮਾਂ|ਟਾਈਮ|ਵਖਤ|ਵੱਖਤ)\s+", ["int", "mod"], "Day"],
                "DateFill1": [r"\s+(\d{1,2} |)\s*(- |ਤੋਂ |ਯਾ |ਜਾਂ |ਅਤੇ |ਤੇ |ਫਿਰ |)\s*(\d{1,2})\s+(ਤਾਰੀਖ਼|ਤਾਰੀਕ|ਤਰੀਕ|ਡੇੇਟ|ਜਨਵਰੀ|ਜਾਨਵਰੀ|ਜਾਨੇਵਰੀ|ਫਰਵਰੀ|ਫੇੇਬਰੂਅਰੀ|ਫੇੇਬਰੂਵਰੀ|ਮਾਰਚ|ਅਪ੍ਰੈਲ|ਏਪ੍ਰਲ|ਮਈ|ਮੇੇ|ਜੂਨ|ਜੁਲਾਈ|ਜਲਾਈ|ਅਗਸਤ|ਔਗਸਟ|ਔਗਸਤ|ਸਤੰਬਰ|ਸੀਤੰਬਰ|ਸੇਤੰਬਰ|ਸਪਤੰਬਰ|ਸਪਟੰਬਰ|ਸਪਟੈਂੰਬਰ|ਅਕਤੂਬਰ|ਅਕਟੂੂਬਰ|ਨਵੰਬਰ|ਨਵੰਬਹ|ਨੌੌਵੰਬਰ|ਦਸੰਬਰ|ਦੀਸੰਬਰ)\s+(\d{4} |)\s*(ਨੂੰ |ਤੱਕ |ਦੇ |ਪਹਿਲਾਂ |ਪਹਿਲੇੇ |ਤੋਂ |)\s*", ["int", "month", "year"], "Date"],
                "DateFill2": [r"\s+(ਜਨਵਰੀ|ਜਾਨਵਰੀ|ਜਾਨੇਵਰੀ|ਫਰਵਰੀ|ਫੇੇਬਰੂਅਰੀ|ਫੇੇਬਰੂਵਰੀ|ਮਾਰਚ|ਅਪ੍ਰੈਲ|ਏਪ੍ਰਲ|ਮਈ|ਮੇੇ|ਜੂਨ|ਜੁਲਾਈ|ਜਲਾਈ|ਅਗਸਤ|ਔਗਸਟ|ਔਗਸਤ|ਸਤੰਬਰ|ਸੀਤੰਬਰ|ਸੇਤੰਬਰ|ਸਪਤੰਬਰ|ਸਪਟੰਬਰ|ਸਪਟੈਂੰਬਰ|ਅਕਤੂਬਰ|ਅਕਟੂੂਬਰ|ਨਵੰਬਰ|ਨਵੰਬਹ|ਨੌੌਵੰਬਰ|ਦਸੰਬਰ|ਦੀਸੰਬਰ)\s+(\d{1,2} |)\s*(ਤਾਰੀਖ਼|ਤਾਰੀਕ|ਤਰੀਕ|ਡੇੇਟ |)\s*(ਨੂੰ |ਤੱਕ |ਦੇ |ਪਹਿਲਾਂ |ਪਹਿਲੇੇ|ਤੋਂ |)\s*", ["int", "month"], "Date"],
                "DateFill3": [r"\s+(ਜਨਵਰੀ|ਜਾਨਵਰੀ|ਜਾਨੇਵਰੀ|ਫਰਵਰੀ|ਫੇੇਬਰੂਅਰੀ|ਫੇੇਬਰੂਵਰੀ|ਮਾਰਚ|ਅਪ੍ਰੈਲ|ਏਪ੍ਰਲ|ਮਈ|ਮੇੇ|ਜੂਨ|ਜੁਲਾਈ|ਜਲਾਈ|ਅਗਸਤ|ਔਗਸਟ|ਔਗਸਤ|ਸਤੰਬਰ|ਸੀਤੰਬਰ|ਸੇਤੰਬਰ|ਸਪਤੰਬਰ|ਸਪਟੰਬਰ|ਸਪਟੈਂੰਬਰ|ਅਕਤੂਬਰ|ਅਕਟੂੂਬਰ|ਨਵੰਬਰ|ਨਵੰਬਹ|ਨੌੌਵੰਬਰ|ਦਸੰਬਰ|ਦੀਸੰਬਰ)\s+(ਅੰਤ|ਆਖਰੀ|ਅਖੀਰ|ਲਾਸਟ|ਐੈਂਡੀਂਗ|ਐੈਂਡ)\s+(ਤਾਰੀਖ਼|ਤਾਰੀਕ|ਤਰੀਕ|ਡੇੇਟ|)\s*(\d{1,2} |)\s*", ["int", "month", "end"], "Date"],
                "DateFill4": [r"\s+(\d{1,2} |)\s*(- |ਤੋਂ |ਯਾ |ਜਾਂ |ਅਤੇ |ਤੇ |ਫਿਰ |)\s*(\d{1,2})\s+(ਨੂੰ |ਤੱਕ |ਦੇ |ਪਹਿਲਾਂ |ਪਹਿਲੇੇ |ਤੋਂ |ਦੇ ਬਾਦ |ਤੋਂ ਪਹਿਲੇੇ |ਤੋਂ ਪਹਿਲਾਂ |ਦੇ ਬਾਅਦ |ਦੇ ਮਗਰੋ| ਕੋਈ)\s+", ["int"], "Date"],
                "DateFill5": [r"\s+(\d{1,2} |)\s*(- |ਤੋਂ |ਯਾ |ਜਾਂ |ਅਤੇ |ਤੇ |ਫਿਰ |)\s*(\d{1,2})\s+(ਤਾਰੀਖ਼|ਤਾਰੀਕ|ਤਰੀਕ|ਡੇੇਟ)\s+(ਤੱਕ |ਵਿਚ |ਵਿੱਚ |ਨੂੰ |)\s*", ["int"], "Date"],
                "DateMonthEnd": [r"\s+(ਇਹ |ਇਸ | ਥਿਸ |ਦਿਸ |ਦਿੱਸ)\s*(ਮੰਥ|ਮਹੀਨੇ|ਮਾਹ|ਮਹੀਨਾ)\s+(ਦੇ |)\s*(ਅੰਤ|ਆਖਰੀ|ਅਖੀਰ|ਲਾਸਟ|ਐੈਂਡੀਂਗ|ਐੈਂਡ |)\s*(ਤੱਕ |ਵਿਚ |ਵਿੱਚ |ਨੂੰ |)\s*(\d{1,2} |)\s*", ["future_mod0", "int", "end"], "Month"],
                "DateNextMonthStart": [r"\s+(ਅਗਲੇ|ਅਗਲਾ|ਨੇਕਸਟ)\s+(ਮੰਥ|ਮਹੀਨੇ|ਮਾਹ|ਮਹੀਨਾ)\s+(ਦੀ |ਦੇ |ਵਿਚ |ਵਿੱਚ |ਨੂੰ |)\s*(\d{1,2} |)\s*(तारीख |)\s*", ["future_mod1", "int"], "Month"],
                "DateNextMonthEnd": [r"\s+(ਅਗਲੇ|ਅਗਲਾ|ਨੇਕਸਟ)\s+(ਮੰਥ|ਮਹੀਨੇ|ਮਾਹ|ਮਹੀਨਾ)\s+(ਦੀ |ਦੇ |)\s*(ਅੰਤ|ਆਖਰੀ|ਅਖੀਰ|ਲਾਸਟ|ਐੈਂਡੀਂਗ|ਐੈਂਡ)\s*(ਤੱਕ |ਵਿਚ |ਵਿੱਚ |ਨੂੰ |)\s*", ["future_mod1", "int", "end"], "Month"],
                "DateXMonthEnd": [r"\s+(\d{1,2})\s+(ਮੰਥ|ਮਹੀਨੇ|ਮਾਹ|ਮਹੀਨਾ)\s+(ਤੱਕ |ਵਿਚ |ਵਿੱਚ |ਨੂੰ |)\s*", ["int"], "Month"],
                "CurrentDate": [r"\s+(ਤੁਰੰਤ|ਹੁਣੇੇ|ਅੱਜ|ਟੁੁਡੇੇ|ਟੂਡੇੇ|ਟੂਡੇੇਸ|ਟੁਡੇੇਸ|ਦੁਪਹਿਰ|ਦੁਪੈੈਰ|ਦੁਪੈੈਰੇੇ)\s+(ਹੀ |ਈ |)\s*", ["future_mod0"], "Day"],
                "CurrentEveningDate": [r"\s+(ਸ਼ਾਮ|ਨਿਸ਼ਾ|ਰਾਤ|ਰਾਤਰੀ|ਨਾਈਟ|ਸਵੇਰ|ਸਵੇਰੇੇ|ਮਾਰਨਿੰੰਗ|ਆਫਟਰਨੂੂਨ|ਦੁਪਹਿਰ|ਦੁਪੈੈਰ|ਦੁਪੈੈਰੇੇ)\s+(ਤੱਕ |ਵਿਚ |ਵਿੱਚ |ਨੂੰ |)\s*", ["future_mod0"], "Day"],
                "TomorrowDate": [r"\s+(ਕੱਲ੍ਹ|ਟੁਮਾਰੋੋ|ਨੇੇਕਸਟ ਡੇੇ|ਅਗਲੇ ਦਿਨ)\s+(ਸ਼ਾਮ|ਨਿਸ਼ਾ|ਰਾਤ|ਰਾਤਰੀ|ਨਾਈਟ|ਸਵੇਰ|ਸਵੇਰੇੇ|ਮਾਰਨਿੰੰਗ|ਆਫਟਰਨੂੂਨ|ਦੁਪਹਿਰ|ਦੁਪੈੈਰ|ਦੁਪੈੈਰੇੇ |)\s*(ਤੱਕ |ਵਿਚ |ਵਿੱਚ |ਨੂੰ |)\s*", ["future_mod1"], "Day"],
                "DayAfterTomorrowDate": [r"\s+(ਪਰਸੋੋਂ|ਪਰਸੋੋ|ਪਰਸੁ|ਡੇੇ ਆਫਟਰ ਟੁੁਮਾਰੋੋ|ਟੂੂਡੇੇਜ|ਕੱਲ੍ਹ ਤੋਂ ਬਾਅਦ ਦਾ ਦਿਨ)\s+(ਸ਼ਾਮ|ਨਿਸ਼ਾ|ਰਾਤ|ਰਾਤਰੀ|ਨਾਈਟ|ਸਵੇਰ|ਸਵੇਰੇੇ|ਮਾਰਨਿੰੰਗ|ਆਫਟਰਨੂੂਨ|ਦੁਪਹਿਰ|ਦੁਪੈੈਰ|ਦੁਪੈੈਰੇੇ |)\s*(ਤੱਕ |ਵਿਚ |ਵਿੱਚ |ਨੂੰ |)\s*", ["future_mod2"], "Day"],
                "NextWeek": [r"\s*( ਅਗਲੇ| ਅਗਲਾ| ਨੇਕਸਟ|)\s+(ਹਫ਼ਤੇੇ|ਹਫ਼ਤਾ|ਵੀਕ|ਸਪਤਾਹ)\s+(ਤੱਕ |ਵਿਚ |ਵਿੱਚ |ਨੂੰ |ਤੋਂ ਪਹਿਲਾਂ|ਬਾਅਦ|ਪਹਿਲੇ|ਅੰਦਰ|)\s*", ["future_mod1", "mod"], "Week"],
                "NextXWeek": [r"\s*( ਅਗਲੇ| ਅਗਲਾ| ਨੇਕਸਟ|)\s+(\d{1,2})\s+(ਹਫ਼ਤੇੇ|ਹਫ਼ਤਾ|ਵੀਕ|ਸਪਤਾਹ)\s+(ਤੱਕ |ਵਿਚ |ਵਿੱਚ |ਨੂੰ |ਤੋਂ ਪਹਿਲਾਂ|ਬਾਅਦ|ਪਹਿਲੇ|ਅੰਦਰ|)\s*", ["int", "mod"], "Week"],
                "GetWeek": [r"\s+(ਅਗਲੇ| ਅਗਲਾ| ਨੇਕਸਟ |)\s*(ਐਤਵਾਰ|ਸੰੰਡੇੇ|ਰਵੀਵਾਰ|ਸੋਮਵਾਰ|ਮੰੰਡੇੇੇ|ਮੰਗਲਵਾਰ|ਟਯੂਸਡੇ|ਟਯੂਜ਼ਡੇ|ਬੁਧਵਾਰ|ਬੁੱਧਵਾਰ|ਵੇਡਨਸਡੇੇ|ਵੇਡਨਜ਼ਡੇੇ|ਵੇਨਜ਼ਡੇੇ|ਵੇਨਸਡੇੇ|ਗੁਰਵਾਰ|ਗੁਰੁਵਾਰ|ਵੀਰਵਾਰ|ਥਰਸਡੇੇ|ਸ਼ੁੱਕਰਵਾਰ|ਫਰਾਈਡੇੇ|ਸ਼ਨੀਵਾਰ|ਸ਼ਨੀਚਰਵਾਰ|ਸੈਟਰ੍ਡੀ|ਸੈਟਿਡੈ)\s+(ਤੱਕ |ਵਿਚ |ਵਿੱਚ |ਨੂੰ |)", ["future_mod1", "weekday"], "Week"],
                "LastWeekOfMonth": [r"\s+(ਅੰਤ|ਆਖਰੀ|ਅਖੀਰ|ਲਾਸਟ|ਐੈਂਡੀਂਗ|ਐੈਂਡ)\s+(ਹਫ਼ਤੇੇ|ਹਫ਼ਤਾ|ਵੀਕ|ਸਪਤਾਹ)\s+(ਤੱਕ |ਵਿਚ |ਵਿੱਚ |ਨੂੰ |)\s*", ["end"], "Date"],
                "NextYear": [r"\s+(ਅਗਲੇ|ਅਗਲਾ|ਨੇਕਸਟ)\s+(ਸਾਲ|ਯੀਅਰ|ਈਅਰ)\s+(ਤੱਕ |ਵਿਚ |ਵਿੱਚ |ਨੂੰ |ਬਾਅਦ |ਬਾਦ |)\s*", ["future_mod1"], "Year"],
                "NextXYear": [r"( ਅਗਲੇ| ਅਗਲਾ| ਨੇਕਸਟ|)\s+(\d{1,2})\s+(ਸਾਲ|ਯੀਅਰ|ਈਅਰ)\s+(ਤੱਕ |ਵਿਚ |ਵਿੱਚ |ਨੂੰ |ਬਾਅਦ |ਬਾਦ |)\s*", ["int"], "Year"],
            }
        
        if lang == "english":
            return {
                "DayToNext": [r"\s*( next| agale| agala| after|)\s+(\d{1,2})\s+(days|day|dino|din)\s+(later |before |)\s*", ["int", "mod"], "Day"],
                "IntervalDays": [r"\s+(\d{1,2} |)\s*(- |to |or |and |)\s*(\d{1,2})\s+(days|day|dino|din)\s+(later |before |)\s*", ["int", "mod"], "Day"],
                "DayToNext2": [r"\s+(in |before |after |within |)\s*(\d{1,2} |)\s*(- |to |or |and |)\s*(\d{1,2})\s+(days|day|dino|din)\s+", ["int","mod"], "Day"],
                "DayToNext3": [r"\s+(\d{1,2} |)\s*(- |to |or |and |)\s*(\d{1,2})\s+(days|day|dino|din)\s+(time |)", ["int", "mod"], "Day"],
                "DateFill1": [r"\s+(on |before |after |within |)\s*(\d{1,2} |)\s*(- |to |or |and |)\s*(\d{1,2})\s+(of |)\s*(january|february|march|april|may|june|july|august|september|october|november|december|jan|feb|sept|oct|nov|dec)\s+(\d{4} |)\s*", ["int", "month", "year"], "Date"],
                "DateFill2": [r"\s+(on |before |after |within |)\s*(january|february|march|april|may|june|july|august|september|october|november|december|jan|feb|sept|oct|nov|dec)\s+(\d{1,2} |)\s*(date |)\s*", ["int", "month"], "Date"],
                "DateFill3": [r"\s+(on |before |after |within |)\s*(january|february|march|april|may|june|july|august|september|october|november|december|jan|feb|sept|oct|nov|dec)\s+(end|last|aakhir|last|ending)\s+(\d{1,2} |)\s*", ["int", "month", "end"], "Date"],
                "DateFill4": [r"\s+(on|before|within|after)\s+(\d{1,2} |)\s*(- |to |or |and |)\s*(\d{1,2})\s+", ["int"], "Date"],
                "DateFill5": [r"\s+(\d{1,2} |)\s*(- |to |or |and |)\s*(\d{1,2})\s+(tarikh|date|ko)\s+", ["int"], "Date"],
                "DateMonthEnd": [r"\s+(this |iss |)\s*(month|months|mahina|maah|mahine|month's)\s+(end |last |ending |akhri |akhir |aakhir |aakhri |)\s*(on |)\s*(\d{1,2} |)\s*", ["future_mod0", "int", "end"], "Month"],
                "DateNextMonthStart": [r"\s+(next|agale|agala)\s+(month|months|mahina|maah|mahine|month\'s)\s+(on |)\s*([0-9]+ |)\s*", ["future_mod1", "int"], "Month"],
                "DateNextMonthEnd": [r"\s+(next|agale|agala)\s+(month|months|mahina|maah|mahine|month's)\s+(on |)\s*(end|last|ending|akhri|akhir|aakhir|aakhri)\s*", ["future_mod1", "int", "end"], "Month"],
                "DateXMonthEnd": [r"\s+(around |after |within |)\s*(\d{1,2})\s+(month|months|mahina|maah|mahine|month's)\s+", ["int", "mod"], "Month"],
                "CurrentDate": [r"\s+(todays|today|aaj|today\'s)\s+(date |din |)\s*", ["future_mod0"], "Day"],
                "CurrentEveningDate": [r"\s+(till |after |before |within |)\s*(evening |night |shaam |raat |subah |morning |afternoon |noon |second |din)\s+", ["future_mod0"], "Day"],
                "TomorrowDate": [r"\s+(till |after |before |within |)\s*(tomorrow|kal|next day)\s+(evening |night |shaam |raat |subah |morning |afternoon |noon |second |din |)\s*", ["future_mod1"], "Day"],
                "DayAfterTomorrowDate": [r"\s+(till |after |before |within |)\s*(parso|day after tomorrow)\s+(evening |night |shaam |raat |subah |morning |afternoon |noon |second |din |)\s*", ["future_mod2"], "Day"],
                "NextWeek": [r"\s+(by |)\s*(next |agale |agala |)\s*(week|hafte|weeks|hafta|saptah)\s+", ["future_mod1", "mod"], "Week"],
                "NextXWeek": [r"\s+(next |agale |agala |till |after |before |within |)\s*(\d{1,2})\s+(week|hafte|weeks|hafta|saptah)\s+", ["int", "mod"], "Week"],
                "GetWeek": [r"\s+(next |agale |agala |till |after |before |within |)\s*(sunday|monday|tuesday|wednesday|thursday|friday|saturday|raviwar|somwar|somvar|mangalwar|mangalvar|budhwar|budhvar|guruwar|guruvar|shukarwar|shukrawar|shukravar|shukarvar|shaniwar|shanivar|ravivar)\s+", ["future_mod1", "weekday"], "Week"],
                "LastWeekOfMonth": [r"\s+(till |after |before |within |)\s*(end|last|ending|akhri|akhir|aakhir|aakhri)\s+(week|hafte|weeks|hafta|saptah)\s+", ["end"], "Date"],
                "NextYear": [r"\s+(till |after |before |within |)\s*(next|agale|agala)\s+(year|saal|years)\s+", ["future_mod1"], "Year"],
                "NextXYear": [r"\s+(till |after |before |within |)\s*(next |agale |agala |)\s*(\d{1,2})\s+(year|saal|years)\s+", ["int"], "Year"],
                "EndOfThisWeek": [r"\s+((aakhri|aakhir|next|end|last|ending)\s+(of |)\s*(this |the |)\s*(hafte|hafta|saptah|week))|(weekend)\s+",["future_mod1", "end"], "Week"],
                "EndOfNextWeek": [r"\s+((aakhri|aakhir|next|end|last|ending)\s+(of |)\s*(the |)\s*(next|agale|agala)\s+(hafte|hafta|saptah|week))|(next weekend)\s+",["future_mod2", "end"], "Week"],
                "EndOfXWeek": [r"\s+(aakhri|aakhir|next|end|last|ending)\s+(of |)\s*(the |)\s*(next |agale |agala |)\s*(\d{1,2})\s+(hafte|hafta|saptah|week)\s+",["int", "end"], "Week"]
            }

        if lang == "gujrati":
            return {
                "DayToNext": [r"\s*( આવતા| આગલા| નેક્સ્ટ|)\s+(\d{1,2})\s+(દિવસ|દિવસો|દી|ડેઝ|ડે)\s*( પછી| પહેલા| અન્દર| અંદર|માં|)\s+(સુધીમાં |)", ["int", "mod"], "Day"],
                "IntervalDays": [r"\s+(\d{1,2} |)\s*(- |થી |અથવા |અને |કે |)\s*(\d{1,2})\s+(દિવસ|દિવસો|દી|ડેઝ|ડે)\s*( પછી| પહેલા| અન્દર| અંદર|માં|)\s+(સુધીમાં |)", ["int", "mod"], "Day"],
                "DayToNext2": [r"\s+(\d{1,2} |)\s*(- |થી |અથવા |અને |કે |)\s*(\d{1,2})\s+(દિવસ|દિવસો|દી|ડેઝ|ડે)\s*(ની|માં|)\s+(પછી |પહેલા |અન્દર |અંદર |)\s*", ["int","mod"], "Day"],
                "DayToNext3": [r"\s+(\d{1,2} |)\s*(- |થી |અથવા |અને |કે |)\s*(\d{1,2})\s+(દિવસ|દિવસો|દી|ડેઝ|ડે)\s*(નો|માં|)\s+(સમય|ટાઈમ)\s+", ["int", "mod"], "Day"],
                "DateFill1": [r"\s+(\d{1,2} |)\s*(- |થી |અથવા |અને |કે |)(\d{1,2})\s+(જાન્યુઆરી|ફેબ્રુઆરી|ફેબ્રુવારી|માર્ચ|માર્ચે|એપ્રિલ|એપ્રિલે|મે|જુન|જુને|જુલાઈ|જુલાય|ઓગસ્ટ|ઓગસ્ટે|સપ્ટેમ્બર|સપ્ટેમ્બરે|સપ્ટેંબર|સપ્ટેંબરે|સપ્ટેબર|ઓક્ટોબર|ઓક્ટોબરે|ઓક્ટોમ્બર|નવેમ્બર|નવેમ્બરે|નવેંબર|ડીસેમ્બર|ડીસેમ્બરે)\s+(\d{4} |)\s*(એ |સુધી |પહેલા |)\s*", ["int", "month", "year"], "Date"],
                "DateFill2": [r"\s+(જાન્યુઆરી|ફેબ્રુઆરી|ફેબ્રુવારી|માર્ચ|માર્ચે|એપ્રિલ|એપ્રિલે|જુન|જુને|જુલાઈ|જુલાય|ઓગસ્ટ|ઓગસ્ટે|સપ્ટેમ્બર|સપ્ટેમ્બરે|સપ્ટેંબર|સપ્ટેંબરે|સપ્ટેબર|ઓક્ટોબર|ઓક્ટોબરે|ઓક્ટોમ્બર|નવેમ્બર|નવેમ્બરે|નવેંબર|ડીસેમ્બર|ડીસેમ્બરે)\s+(\d{1,2} |)\s*(date |)\s*", ["int", "month"], "Date"],
                "DateFill3": [r"\s+(જાન્યુઆરી|ફેબ્રુઆરી|ફેબ્રુવારી|માર્ચ|માર્ચે|એપ્રિલ|એપ્રિલે|જુન|જુને|જુલાઈ|જુલાય|ઓગસ્ટ|ઓગસ્ટે|સપ્ટેમ્બર|સપ્ટેમ્બરે|સપ્ટેંબર|સપ્ટેંબરે|સપ્ટેબર|ઓક્ટોબર|ઓક્ટોબરે|ઓક્ટોમ્બર|નવેમ્બર|નવેમ્બરે|નવેંબર|ડીસેમ્બર|ડીસેમ્બરે)\s+(માં |સુધીમાં | )\s*(\d{1,2} |)\s*", ["int", "month", "end"], "Date"],
                "DateFill4": [r"\s+(\d{1,2} |)\s*(- |થી |અથવા |અને |કે |)\s*(\d{1,2})\s+(એ|સુધીમાં|પહેલા|પછી|ની પહેલા|એજ)\s+", ["int"], "Date"],
                "DateFill5": [r"\s+(\d{1,2} |)\s*(- |થી |અથવા |અને |કે |)\s*(\d{1,2})\s+(તારીખ|તારીખે|ડેટ|તિથી)\s*( સુધીમાં |માં | એ |)\s*", ["int"], "Date"],
                "DateMonthEnd": [r"\s+(આ |ધીસ |દિસ |)\s*(મંથ|મહીને|માસ|મહિના)\s+(સુધીમાં |એ |માં |)\s*(\d{1,2} |)\s*", ["future_mod0", "int", "end"], "Month"],
                "DateNextMonthStart": [r"\s+(આવતાં|આવતા|આગલા|નેક્સ્ટ)\s+(મંથ|મહીને|માસ|મહિના)\s+(ની |નિ |એ |માં |મા |)\s*([0-9]+ |)\s*", ["future_mod1", "int"], "Month"],
                "DateNextMonthEnd": [r"\s+(આવતાં|આવતા|આગલા|નેક્સ્ટ)\s+(મંથ|મહીને|માસ|મહિના)\s+(ના |)\s*(એંડ|એન્ડ |લાસ્ટ|એન્ડિંગ|અંત)\s*(સુધીમાં |એ |માં |)\s*", ["future_mod1", "int", "end"], "Month"],
                "DateXMonthEnd": [r"\s+(\d{1,2})\s+(મંથ|મહીને|માસ|મહિના)\s+(સુધીમાં |માં |)\s*", ["int", "mod"], "Month"],
                "CurrentDate": [r"\s+(હમણાં|અત્યારે|તરત|આજે|ટુડે|બપોરે)\s+(જ |)\s*", ["future_mod0"], "Day"],
                "CurrentEveningDate": [r"\s+(સાંજ|રાત|નાઈટ|સવાર|મોર્નિંગ|આફ્ટરનૂન|બપોર)\s+(સુધીમાં |એ |માં |)\s*(સુધીમાં |માં |એ |)\s*", ["future_mod0"], "Day"],
                "TomorrowDate": [r"\s+(કાલે|આવતીકાલે|કાલ|ટુમોરો|નેક્સ્ટ ડે)\s+(સાંજ |રાત |નાઈટ |સવાર |મોર્નિંગ |આફ્ટરનૂન |બપોર |)\s*(સુધીમાં |માં |એ |)\s*", ["future_mod1"], "Day"],
                "DayAfterTomorrowDate": [r"\s+(પરમદી|પરમદિવસ|પરમ દિવસે|પરમદિવસે|ડે આફ્ટર ટુમોરો|ટુડેઝ)\s+(સાંજ |રાત |નાઈટ |સવાર |મોર્નિંગ |આફ્ટરનૂન |બપોર |)\s*(સુધીમાં |માં |એ |)\s*", ["future_mod2"], "Day"],
                "NextWeek": [r"\s*( આવતાં| આવતા| આગલા| નેક્સ્ટ|)\s+(અઠવાડિયું|અઠવાડિયા|અઠવાડિયે|વીક)\s+(સુધીમાં |માં |)\s*", ["future_mod1", "mod"], "Week"],
                "NextXWeek": [r"\s+(આવતાં |આવતા |આગલા |નેક્સ્ટ |)\s*(\d{1,2})\s+(અઠવાડિયું|અઠવાડિયા|અઠવાડિયે|વીક)\s+(સુધીમાં |માં |)\s*", ["int", "mod"], "Week"],
                "GetWeek": [r"\s+(આવતા |આગલા |નેક્સ્ટ |)\s*(રવિવાર|રવિવારે|સંડે|સોમવાર|સોમવારે|મંડે|મંગળવાર|મંગળવારે|ટ્યુઝડે|બુધવાર|બુધવારે|વેનસડે|વેડનસડે|ગુરુવાર|ગુરુવારે|થર્સડે|શુક્રવાર|શુક્રવારે|ફ્રાઈડે|ફ્રાયડે|શનિવાર|શનિવારે|સેટરડે)\s+(સુધીમાં |માં |)\s*", ["future_mod1", "weekday"], "Week"],
                "LastWeekOfMonth": [r"\s+(છેલ્લા|આખરી|એંડ|લાસ્ટ|એન્ડિંગ)\s+(અઠવાડિયું|અઠવાડિયા|અઠવાડિયે|વીક)\s+(સુધીમાં |માં |એ |)\s*", ["end"], "Date"],
                "NextYear": [r"\s+(આવતા|આગલા|નેક્સ્ટ)\s+(વર્ષ|વરસ|યર|ઈયર)\s+(સુધીમાં |માં |પછી |)\s*", ["future_mod1"], "Year"],
                "NextXYear": [r"\s+(આવતા | આગલા| નેક્સ્ટ |)\s*(\d{1,2})\s+(વર્ષ|વરસ|યર|ઈયર)\s+(સુધીમાં |માં |પછી |)\s*", ["int"], "Year"],
            }
        
        if lang == "oriya":
            return {
                "DayToNext": [r"\s+(अगले |अगला |नेक्स्ट |)\s*(\d{1,2})\s+(दिन|दिनों|दिनो|डेज|डे)\s+(बाद |पहले |अंदर |)\s*(में |)", ["int", "mod"], "Day"],
                "IntervalDays": [r"\s+(\d{1,2} |)\s*(- |से |या |और |तो |)\s*(\d{1,2})\s+(दिन|दिनों|दिनो|डेज|डे)\s+(बाद |पहले |अंदर |)\s*(में |तक |)\s*", ["int", "mod"], "Day"],
                "DayToNext2": [r"\s+(\d{1,2} |)\s*(- |से |या |और |तो |)\s*(\d{1,2})\s+(दिन|दिनों|दिनो|डेज|डे)\s+(के |)\s*(बाद|अंदर|पहले)\s+", ["int", "mod"], "Day"],
                "DayToNext3": [r"\s+(\d{1,2} |)\s*(- |से |या |और |तो |)\s*(\d{1,2})\s+(दिन|दिनों|दिनो|डेज|डे)\s+(का |के |)\s*(टाइम)", ["int", "mod"], "Day"],
                "DateFill1": [r"\s+(\d{1,2} |)\s*(- |से |या |और |तो |)\s*(\d{1,2})\s+(जनवरी|फरवरी|फेब्रुअरी|फेब्रुवारी|मार्च|अप्रैल|मई|जून|जुलाई|अगस्त|सितम्बर|सितंबर|सप्टेंबर|सेप्टेम्बर|सेप्तेम्बर|सेप्टैंबर|अक्टूबर|नवंबर|दिसंबर|january|february|march|april|may|june|july|august|september|october|november|december)\s+(\d{4} |)\s*(को |तक |के पहले |)\s*", ["int", "month", "year"], "Date"],
                "DateFill2": [r"\s+(जनवरी|फरवरी|फेब्रुअरी|फेब्रुवारी|मार्च|अप्रैल|मई|जून|जुलाई|अगस्त|सितम्बर|सितम्बर|सितंबर|सप्टेंबर|सेप्टेम्बर|सेप्तेम्बर|सेप्टैंबर|अक्टूबर|नवंबर|दिसंबर|january|february|march|april|may|june|july|august|september|october|november|december)\s+(\d{1,2} |)\s*(तारीख |)\s*(को |तक |के पहले |में |)\s*", ["int", "month"], "Date"],
                "DateFill3": [r"\s+(जनवरी|फरवरी|फेब्रुवारी|फेब्रुअरी|मार्च|अप्रैल|मई|जून|जुलाई|अगस्त|सितम्बर|सितंबर|सप्टेंबर|सेप्टेम्बर|सेप्तेम्बर|सेप्टैंबर|अक्टूबर|नवंबर|दिसंबर|january|february|march|april|may|june|july|august|september|october|november|december)\s+(एंड|आखिर|लास्ट|एंडिंग)\s+(में |तक |)\s*(\d{1,2} |)\s*", ["int", "month", "end"], "Date"],
                "DateFill4": [r"\s+(\d{1,2} |)\s*(- |से |या |और |तो |)\s*(\d{1,2})\s+(को|तक|के पहले|से पहले|तो|कोई)\s+", ["int"], "Date"],
                "DateFill5": [r"\s+(\d{1,2} |)\s*(- |से |या |और |तो |)\s*(\d{1,2})\s+(तारीख|डेट|तिथि|दिनांक)\s+(तक |में |)\s*", ["int"], "Date"],
                "DateMonthEnd": [r"\s+(इस |यह |थिस |दिस |)\s*(मंथ|महीने|माह|महीना)\s*( के|)\s+(एंड |आखिर |लास्ट |)\s*(तक |को |में |की |)\s*(\d{1,2} |)\s*", ["future_mod0", "int", "end"], "Month"],
                "DateNextMonthStart": [r"\s+(अगला|अगले|नेक्स्ट)\s+(मंथ|महीने|माह|महीनो|महीनों|महीना)\s+(की |पे |तक |)\s*(\d{1,2} |)\s*(तारीख |)\s*", ["future_mod1", "int"], "Month"],
                "DateNextMonthEnd": [r"\s+(अगला|अगले|नेक्स्ट)\s+(मंथ|महीने|माह|महीनो|महीनों|महीना)\s+(के |)\s*(एंड|आखिर|लास्ट|एंडिंग)\s*(तक |को |में |)\s*", ["future_mod1", "int", "end"], "Month"],
                "DateXMonthEnd": [r"\s+(\d{1,2})\s+(मंथ|महीने|माह|महीनो|महीनों|महीना)\s+(तक |में |के |)\s*(बाद |)\s*", ["int"], "Month"],
                "CurrentDate": [r"\s+(तुरंत|अभी|आज|टुडे|टुडेस|दोपहर|आजकल)\s+(ही |में |)\s*", ["future_mod0"], "Day"],
                "CurrentEveningDate": [r"\s+(शाम|रात|नाईट|सुबह|मॉर्निंग|आफ्टरनून|दोपहर)\s+(तक |को |में |)\s*", ["future_mod0"], "Day"],
                "TomorrowDate": [r"\s+(कल|टुमारो|नेक्स्ट डे|नेक्स्ट डेट)\s+(शाम |रात |नाईट |सुबह |मॉर्निंग |आफ्टरनून |दोपहर |)\s*(तक |में |कर |को |)\s*", ["future_mod1"], "Day"],
                "DayAfterTomorrowDate": [r"\s+(परसों|परसु|परसो|डे आफ्टर टुमारो|टूडेज)\s+(शाम |रात |नाईट |सुबह |मॉर्निंग |आफ्टरनून |दोपहर |)\s*(तक |में |कर |को |)\s*", ["future_mod2"], "Day"],
                "NextWeek": [r"\s*( अगला| अगले| नेक्स्ट|)\s+(हफ्ते|हफ्ता|वीक|सप्ताह)\s+(तक |में |के पहले |बाद |पहले |अंदर |)\s*", ["future_mod1", "mod"], "Week"],
                "NextXWeek": [r"( अगला| अगले| नेक्स्ट|)\s+(\d{1,2})\s+(हफ्ते|हफ्ता|वीक|सप्ताह)\s+(तक |में |के पहले |बाद |पहले |अंदर |)\s*", ["int", "mod"], "Week"],
                "GetWeek": [r"\s+(अगला |अगले |नेक्स्ट |अगली |)\s*(रविवार|संडे|सोमवार|मंडे|मंगलवार|ट्यूसडे|बुधवार|वेडनेसडे|वेनसडे|गुरुवार|थर्सडे|शुक्रवार|फ्राइडे|शनिवार|सैटरडे|सेटरडे|monday|tuesday|wednesday|thursday|friday|saturday|sunday)\s+(तक |में |)", ["future_mod1", "weekday"], "Week"],
                "LastWeekOfMonth": [r"\s+(आखरी|एंड|आखिर|लास्ट|एंडिंग)\s+(हफ्ते|हफ्ता|वीक|सप्ताह)\s+(तक |में |को |)\s*", ["end"], "Date"],
                "NextYear": [r"\s+(अगले|अगला|नेक्स्ट|1|एक|वन)\s+(साल|ईयर)\s+(तक |में |बाद |)\s*", ["future_mod1"], "Year"],
                "NextXYear": [r"( अगला| अगले| नेक्स्ट|)\s+(\d{1,2})\s+(साल|ईयर)\s+(तक |में |बाद |)\s*", ["int"], "Year"],
            }

    def get_pattern_time(self, lang = "hindi"):
        
        if lang == "hindi":
            return {
                "exactTime": [r"\s+(\d{1,2}):(\d{1,2})\s+(ऍम |पीऍम |पीएम |ऐम |बजे |बजकर |बज |ओ क्लॉक |ओ क्लोक |बज कर |am |pm |a.m. |p.m. )", ["hour", "minute", "meridiam"], "exact_time"],
                "IntervalTimeWithoutColon": [r"\s+(\d{1,2} |)\s*(- |से |या |और |तो |)\s*(\d{1,2})\s+(ऍम|पीऍम|पीएम|ऐम|बजे|बजकर|बज|ओ क्लॉक|ओ क्लोक|बज कर|am|pm|a.m.|p.m.)\s+", ["hour", "minute", "meridiam"], "exact_time"],
                "intervalExactTime": [r"\s+(\d{1,2}):(\d{1,2})\s+(- |से |या |और |तो |)\s*(\d{1,2}):(\d{1,2})\s+(ऍम |पीऍम |पीएम |ऐम |बजे |बजकर |बज |ओ क्लॉक |ओ क्लोक |बज कर |o'clock |am |pm |a.m. |p.m. )", ["hour", "minute", "meridiam"], "exact_time"],
                "relativeTime": [r"\s+(\d{1,2})\s+(घंटे|घंटा|ऑवर|आर|आवर)\s+", ["hour"], "relative_time"],
                "intervalRelativeTime": [r"\s+(\d{1,2} |)\s*(- |से |या |और |तो |)\s*(\d{1,2} |)\s*(घंटे|घंटा|ऑवर|आर|आवर)\s+", ["hour"], "relative_time"],
                "intervalExactMinutesTime": [r"\s+(\d{1,2} |)\s*(- |से |या |और |तो |)\s*(मिनिट|मिनिटे)\s+", ["minute"], "relative_minute"],
                "exactMinutesTime": [r"\s+(\d{1,2} |)\s*(- |से |या |और |तो |)\s*(\d{1,2})\s*(मिनिट|मिनिटे|मिनट)\s+", ["minute"], "exact_minute"],
                "daytime": [r"\s+(शाम|इवनिंग|रात|नाईट|सुबह|मॉर्निंग|आफ्टरनून|दोपहर|सेकंड|tonight|night|evening|morning|afternoon|noon)\s+",  ["daytime"], "daytime"]
            }

        if lang == "kannada":
            return {
                "exactTime": [r"\s+(\d{1,2}):(\d{1,2})\s+(ಎಎಂ |ಪಿಎಂ |ಗಂಟೆ |ಗಂಟೆಗೆ |ಗಂಟೆಗೇ |ಗಂಟೆಗಳ |ಗೆ |ಗೇ |ಒ ಕ್ಲಾಕ್ |ಗಂಟೆಯೊಳಗೆ |ಗಂಟೆಯ |)\s*", ["hour", "minute", "meridiam"], "exact_time"],
                "IntervalTimeWithoutColon": [r"\s+(\d{1,2} |)\s*(- |ಇಂದ |ರಿಂದ |ಅಥವಾ |ಇಲ್ಲ |)\s*(\d{1,2})\s+(ಎಎಂ|ಪಿಎಂ|ಗಂಟೆ|ಗಂಟೆಗೆ|ಗಂಟೆಗೇ|ಗಂಟೆಗಳ|ಗೆ|ಗೇ|ಒ ಕ್ಲಾಕ್|ಗಂಟೆಯೊಳಗೆ|ಗಂಟೆಯ)\s+", ["hour", "minute", "meridiam"], "exact_time"],
                "intervalExactTime": [r"\s+(\d{1,2}):(\d{1,2})\s+(- |ಇಂದ |ರಿಂದ |ಅಥವಾ |ಇಲ್ಲ |)\s*(\d{1,2}):(\d{1,2})\s+(ಎಎಂ |ಪಿಎಂ |ಗಂಟೆ |ಗಂಟೆಗೆ |ಗಂಟೆಗೇ |ಗಂಟೆಗಳ |ಗೆ |ಗೇ |ಒ ಕ್ಲಾಕ್ |ಗಂಟೆಯೊಳಗೆ |ಗಂಟೆಯ |)\s*", ["hour", "minute", "meridiam"], "exact_time"],
                "relativeTime": [r"\s+(\d{1,2})\s+(ಗಂಟೆ|ಹೌರ|ಹವರ್|ಅವರ್|ಹಾರ್|ಆವರ|ಆರ್)\s+", ["hour"], "relative_time"],
                "intervalRelativeTime": [r"\s+(\d{1,2})\s+(ನಿಮಿಷ|ಮಿನಿಟ್|ಮಿನುಟ್|ನಿಮಿಷಗಳ)\s+", ["hour"], "relative_time"],
                "intervalExactMinutesTime": [r"\s+(\d{1,2})\s+(- |ಇಂದ |ರಿಂದ |ಅಥವಾ |ಇಲ್ಲ |)\s*(\d{1,2})\s+(ನಿಮಿಷ|ಮಿನಿಟ್|ಮಿನುಟ್)\s+", ["minute"], "relative_minute"],
                "exactMinutesTime": [r"\s+(\d{1,2})\s+(- |ಇಂದ |ರಿಂದ |ಅಥವಾ |ಇಲ್ಲ |)\s*(\d{1,2})\s+(ನಿಮಿಷ|ಮಿನಿಟ್|ಮಿನುಟ್)\s+", ["minute"], "exact_minute"],
                "daytime": [r"\s+(ಮಧ್ಯಾಹ್ನ|ಆಫ್ಟರ್ನೂನ್|ಆಫ್ಟರ್ ನೂನ್|ಇವಾಗ|ಈಗ|ಈಗಲೇ|ಇವಾಗ್ಲೆ|ಈಗಿನಿಂದಲೇ|ಈಗಲೆ|ಕೂಡಲೇ|ಕುಡ್ಲೆ|ಇಮ್ಮಿಡಿಯೇಟಲಿ|ತಕ್ಷಣ|ತಕ್ಷಣವೇ|ಇವಾಗ್ಲೇ|ಇವಾಗಲೇ|ಸಾಯಂಕಾಲ|ಸಂಜೆ|ಬೆಳೆಗೆ|ಇವಿನಿಂಗ್|ಮಾರ್ನಿಂಗ್|ನೈಟ್|ಬೆಳಿಗೆ|ರಾತ್ರಿ|ರಾತ್ರಿಗೆ|ಸಂಜೆಗೆ|ರಾತ್ರಿನೇ|ಬೆಳೆಗೇನೆ|ಸಂಜೆಯೊಳಗೆ|ಬೆಳಿಗೆಯೊಳಗೆ|ರಾತ್ರಿಯೊಳಗೆ|ಮಧ್ಯಾಹ್ನದೊಳಗೆ|ರಾತ್ರಿಯವರೆಗೆ|ಬೆಳಗ್ಗೆ|ಸಂಜೆಯ|ಇವಾಗೆ|ಈಗ್ಲೇ|ಬೆಳಿಗ್ಗೆ)\s+",  ["daytime"], "daytime"]
            }
        
        if lang == "marathi":
            return {
                "exactTime": [r"\s+(\d{1,2}):(\d{1,2})\s+(ऍम |पीऍम |पीएम |ऐम |वास्ता |ओ क्लॉक |ओ क्लोक |)", ["hour", "minute", "meridiam"], "exact_time"],
                "IntervalTimeWithoutColon": [r"\s+(\d{1,2} |)\s*(- |ते |या |आणि |)\s*(\d{1,2})\s+(ऍम|पीऍम|पीएम|ऐम|वास्ता|ओ क्लॉक|ओ क्लोक)\s+", ["hour", "minute", "meridiam"], "exact_time"],
                "intervalExactTime": [r"\s+(\d{1,2}):(\d{1,2})\s+(- |ते |या |आणि |)\s*(\d{1,2}):(\d{1,2})\s+(ऍम |पीऍम |पीएम |ऐम |वास्ता |ओ क्लॉक |ओ क्लोक |)", ["hour", "minute", "meridiam"], "exact_time"],
                "relativeTime": [r"\s+(\d{1,2})\s+(घंटे|घंटा|ऑवर|आर|आवर)\s+", ["hour"], "relative_time"],
                "intervalRelativeTime": [r"\s+(\d{1,2})\s+(- |ते |या |आणि |)\s*(\d{1,2})\s+(घंटे|घंटा|ऑवर|आर|आवर)\s+", ["hour"], "relative_time"],
                "intervalExactMinutesTime": [r"s+(\d{1,2})\s+(- |ते |या |आणि |)\s*(\d{1,2})\s+(मिनिट|मिनिटात|मिन्टात)\s+", ["minute"], "relative_minute"],
                "exactMinutesTime": [r"\s+(\d{1,2})\s+(मिनिट|मिनिटात|मिन्टात)\s+", ["minute"], "exact_minute"],
                "daytime": [r"\s+(संध्याकाळ|संध्याकाळी|सायंकाडी|सायंकाळी|संध्याकाळपर्यंत|रात्री|रात्रीपर्यंत|नाईट|सकाळी|मॉर्निंग|आफ्टरनून|दुपारी|तुरंत|ताबडतोब|आता|लगेच)\s+",  ["daytime"], "daytime"]
            }
        
        if lang == "telugu":
            return {
                "exactTime": [r"\s*( పొద్దున | ఉదయం | ఉదయాన్నే | ప్రొద్దున | పొద్దున్నే | మార్నింగ్ | మధ్యాహ్నం | మద్యానం | పగటీలి | సాయంత్రం | ఆఫ్టేర్నూన్ |ఆఫ్టర్ నూన్ | ఈవెనింగ్ | సాయంకాలం | రాత్రి | నైట్ |)\s*(\d{1,2}):(\d{1,2})\s+(కి|ఇంటికి|గంటలకు|గంటకు|ఇంటి వరకు|ఇంటివరకు|ఓ క్లాక్|ఏ ఎమ్|ఏఎమ్|am|పీ ఎమ్|పీఎమ్|pm|a.m.|p.m.)\s+", ["hour", "minute", "meridiam"], "exact_time"],
                "IntervalTimeWithoutColon": [r"\s+(పొద్దున|ఉదయం|ఉదయాన్నే|ప్రొద్దున|పొద్దున్నే|మార్నింగ్|మధ్యాహ్నం|మద్యానం|పగటీలి|సాయంత్రం|ఆఫ్టేర్నూన్|ఆఫ్టర్ నూన్|ఈవెనింగ్|సాయంకాలం|రాత్రి|నైట్)\s*(\d{1,2} |)\s*(- |నుండి |లేదా |ఆర్ |)\s*(\d{1,2})\s+", ["hour", "minute", "meridiam"], "exact_time"],
                "intervalExactTime": [r"\s+(పొద్దున |ఉదయం |ఉదయాన్నే |ప్రొద్దున |పొద్దున్నే |మార్నింగ్ |మధ్యాహ్నం |మద్యానం |పగటీలి |సాయంత్రం |ఆఫ్టేర్నూన్ |ఆఫ్టర్ నూన్ |ఈవెనింగ్ |సాయంకాలం |రాత్రి |నైట్ |)\s*(\d{1,2}):(\d{1,2})\s+(- |నుండి |లేదా |ఆర్ |)\s*(\d{1,2}):(\d{1,2})\s+(కి|ఇంటికి|గంటలకు|గంటకు|ఇంటి వరకు|ఇంటివరకు|ఓ క్లాక్|ఏ ఎమ్|ఏఎమ్|am|పీ ఎమ్|పీఎమ్|pm|a.m.|p.m.)\s+", ["hour", "minute", "meridiam"], "exact_time"],
                "relativeTime": [r"\s*( ఇంకో | మోర్ | నెక్స్ట్ | వచ్చే | ఆఫ్టర్ | ఇంకా | ఈ |)\s*(\d{1,2})\s+(గంటల|హౌర్స్|గంటలు|గంటల్లో|అవర్|అవర్స్)\s+(తర్వాత |అయ్యాక |అయినాక |అయినంక |లో |లోపు |ఆఫ్టర్ |వరకు |కల్లా |లోపల |లోగా |)\s*", ["hour"], "relative_time"],
                "intervalRelativeTime": [r"\s*( ఇంకో | మోర్ | నెక్స్ట్ | వచ్చే | ఆఫ్టర్ | ఇంకా | ఈ |)\s*(\d{1,2})\s+(- |నుండి |లేదా |ఆర్ |)\s*(\d{1,2})\s+(గంటల|హౌర్స్|గంటలు|గంటల్లో|అవర్స్)\s+(తర్వాత |అయ్యాక |అయినాక |అయినంక |లో |లోపు |ఆఫ్టర్ |వరకు |కల్లా |లోపల |లోగా |)\s*", ["hour"], "relative_time"],
                "intervalExactMinutesTime": [r"\s+(\d{1,2})\s+(- |నుండి |లేదా |ఆర్ |టు |)\s*(\d{1,2})\s+(మినిట్స్|మినెట్స్|నిమిషాలకు|నిమిషాల్లో)\s+", ["minute"], "relative_minute"],
                "exactMinutesTime": [r"\s+(\d{1,2})\s+(మినిట్స్|మినెట్స్|నిమిషాలకు|నిమిషాల్లో)\s+", ["minute"], "exact_minute"],
                "daytime": [r"\s+(పొద్దున|ఉదయం|ఉదయాన్నే|ప్రొద్దున|పొద్దున్నే|మార్నింగ్|మధ్యాహ్నం|మద్యానం|పగటీలి|సాయంత్రం|ఆఫ్టేర్నూన్|ఆఫ్టర్ నూన్|ఈవెనింగ్|ఈవినింగ్|సాయంకాలం|రాత్రి|నైట్|చీకటి|వెంటనే|ఇప్పుడే|ఇప్పుడు|ఇమ్మీడియేటగా|తక్షణమే|క్షణం|క్షణమే|క్షణంలో)\s+",  ["daytime"], "daytime"]
            }
        
        if lang == "malayalam":
            return {
                "exactTime": [r"\s+(\d{1,2}):(\d{1,2})\s+(എഎം |പിഎം |മണി |മണിക്ക് |ക്ക് |തിന് |ന് |തിനു |സമയം |ഓ ക്ലോക്ക് |)\s*", ["hour", "minute", "meridiam"], "exact_time"],
                "IntervalTimeWithoutColon": [r"\s+(\d{1,2} |)\s*(- |മുതൽ |നിന്നു |നിന്ന് |തുടങ്ങി |)\s*(\d{1,2})\s+(എഎം |പിഎം |മണി |മണിക്ക് |ക്ക് |തിന് |ന് |തിനു |സമയം |ഓ ക്ലോക്ക്)\s*", ["hour", "minute", "meridiam"], "exact_time"],
                "intervalExactTime": [r"\s+(\d{1,2}):(\d{1,2})\s+(- |മുതൽ |നിന്നു |നിന്ന് |തുടങ്ങി |)\s*(\d{1,2}):(\d{1,2})\s+(എഎം |പിഎം |മണി |മണിക്ക് |ക്ക് |തിന് |ന് |തിനു |സമയം |ഓ ക്ലോക്ക് |)", ["hour", "minute", "meridiam"], "exact_time"],
                "relativeTime": [r"\s+(\d{1,2})\s*(മണിക്കൂർ|മണിക്കൂറിൽ|ഹവർ)\s+", ["hour"], "relative_time"],
                "intervalRelativeTime": [r"\s+(\d{1,2})\s+(- |മുതൽ |നിന്നു |നിന്ന് |തുടങ്ങി |)\s*(\d{1,2})\s+(മണിക്കൂർ|മണിക്കൂറിൽ|ഹവർ)\s+", ["hour"], "relative_time"],
                "intervalExactMinutesTime": [r"\s+(\d{1,2})\s+(- |മുതൽ |നിന്നു |നിന്ന് |തുടങ്ങി |)\s*(\d{1,2})\s+(മിനിറ്റ്|മിനിട്ട്‌)\s+", ["minute"], "relative_minute"],
                "exactMinutesTime": [r"\s+(\d{1,2})\s+(മിനിറ്റ്|മിനിട്ട്‌)\s+", ["minute"], "exact_minute"],
                "daytime": [r"\s*(രാത്രി |നൈറ്റ് |വൈകിട്ട് |വൈകുന്നേരം |സന്ധ്യ |എവെനിംഗ് |ഉച്ച|ഉച്ചക്ക്|ഉച്ചകഴിഞ്ഞ് |അഫ്റെർൂൺ |രാവിലെ |മോണിങ് |പുലർച്ചെ |പുലര്വേള|പുലർവേള|ഇപ്പോൾ|ഇപ്പോള്|നൗ|ഇപ്പം|ഇപ്പൊ)\s*",  ["daytime"], "daytime"]
            }

        if lang == "bengali":
            return {
                "exactTime": [r"\s+(\d{1,2}):(\d{1,2})\s+(এম |পিএম |পিয়েম |টায় |টার সময় |ও ক্লক |)\s*", ["hour", "minute", "meridiam"], "exact_time"],
                "IntervalTimeWithoutColon": [r"\s+(\d{1,2} |)\s*(- |থেকে |বা |অথবা |)\s*(\d{1,2})\s+(এম|পিএম|পিয়েম|টায়|টার সময়|ও ক্লক)\s+", ["hour", "minute", "meridiam"], "exact_time"],
                "intervalExactTime": [r"\s+(\d{1,2}):(\d{1,2})\s+(- |থেকে |বা |অথবা |)\s*(\d{1,2}):(\d{1,2})\s+(এম |পিএম |পিয়েম |টায় |টার সময় |ও ক্লক |)\s*", ["hour", "minute", "meridiam"], "exact_time"],
                "relativeTime": [r"\s+(\d{1,2})\s*(ঘণ্টা|ঘণ্টায়|আওয়ার|হাওয়ার)\s*", ["hour"], "relative_time"],
                "intervalRelativeTime": [r"\s+(\d{1,2})\s+(- |থেকে |বা |অথবা |)\s*(\d{1,2})\s*(ঘণ্টা| ঘণ্টায়| আওয়ার| হাওয়ার)\s+", ["hour"], "relative_time"],
                "intervalExactMinutesTime": [r"\s+(\d{1,2})\s+(- |থেকে |বা |অথবা |)\s*(\d{1,2})\s*(মিনিট| মিনিটে)\s+", ["minute"], "relative_minute"],
                "exactMinutesTime": [r"\s+(\d{1,2})\s*(মিনিট|মিনিটে)\s+", ["minute"], "exact_minute"],
                "daytime": [r"\s+(জলদি|এক্ষুনি|ইক্ষুণী|ইক্ষুনি|আখনী|এখনই|সেকেন্ড|এক্ষুণি|একটু পর|একটুপর|একটু পরে|একটু খুনী পর|কিছুক্ষণের মধ্যে|কিছুক্ষণ পর|কিছুক্ষণ পরে|কয়েকঘন্টার মধ্যে|কয়েক ঘন্টার মধ্যে|এক্ষুণি|এক্ষুণী|একখুনী|এক্ষুনী|এক্ষুনি|এখনই|একখুনি|এখুনি|আখনই|আখনী)\s+", ["daytime"], "daytime"]
            }

        if lang == "tamil":
            return {
                "exactTime": [r"\s+(\d{1,2}):(\d{1,2})\s+(ஏஎம் |பிஎம் |மணிநேரம் |மணிக்கு |மணி |ஓ கிளாக் |)\s*", ["hour", "minute", "meridiam"], "exact_time"],
                "IntervalTimeWithoutColon": [r"\s+(\d{1,2} |)\s*(- |முதல் |இல்ல |இல்லனா |இல்லாட்டி |)\s*(\d{1,2})\s+(ஏஎம்|பிஎம்|மணிநேரம்|மணிக்கு|மணி|ஓ கிளாக்)\s+", ["hour", "minute", "meridiam"], "exact_time"],
                "intervalExactTime": [r"\s+(\d{1,2}):(\d{1,2})\s+(- |முதல் |இல்ல |இல்லனா |இல்லாட்டி |)\s*(\d{1,2}):(\d{1,2})\s+(மணிக்கு |மணி |மணிக்குள்ள |ஏஎம் |)\s*", ["hour", "minute", "meridiam"], "exact_time"],
                "relativeTime": [r"\s+(ஆஃப்டர் |)\s*(\d{1,2})\s+(மணிநேரம்|ஹவர்|ஹவர்ஸ்)\s+(கழிச்சு |கழித்து |அப்புறம் |அப்றம் |)\s*", ["hour"], "relative_time"],
                "intervalRelativeTime": [r"\s+(ஆஃப்டர் |)\s*(\d{1,2} |)\s*(- |இலிருந்து |முதல் |இல்லனா |இல்லாட்டி |)\s*(\d{1,2})\s+(மணிநேரம்|ஹவர்|ஹவர்ஸ்)\s+(கழிச்சு |கழித்து |அப்புறம் |அப்றம் |)\s*", ["hour"], "relative_time"],
                "intervalExactMinutesTime": [r"\s+(ஆஃப்டர் |)\s*(\d{1,2} |)\s*(- |இலிருந்து |முதல் |இல்லனா |இல்லாட்டி |டூ |)\s*(\d{1,2})\s+(மினிட்ஸ்|நிமிடம்|நிமிசம்|நிமிடங்கள்|நிமிஷங்கள்|நிமிடங்களில்|நிமிஷங்களில்|மினிட்)\s+", ["minute"], "relative_minute"],
                "exactMinutesTime": [r"\s+(\d{1,2})\s+(மினிட்ஸ்|நிமிடம்|நிமிசம்|நிமிடங்கள்|நிமிஷங்கள்|நிமிடங்களில்|நிமிஷங்களில்|மினிட்)\s+", ["minute"], "exact_minute"],
                "daytime": [r"\s+(மார்னிங்|காலை|மதியம்|மதியானம்|நூன்|ஆப்டர்நூன்|இரவு|மத்தியானம்|ஈவினிங்|மாலை|சாயிந்திரம்|சாயுங்காலம்|நைட்|ராத்திரி|நைட்டு|இப்போது|இப்போதே|இப்பவே|உடனடியாக|இப்போ|இப்ப|உடனே|இப்பவே|ரைட்நவ்|நவ்|இப்பொழுது)\s+", ["daytime"], "daytime"]
            }

        if lang == "punjabi":
            return {
                "exactTime": [r"\s+(\d{1,2}):(\d{1,2})\s+(ਏ.ਐੱਮ |ਪੀ.ਐੱਮ |ਪੀ ਐਮ |ਐਮ |ਵੱਜੇੇ |ਵਜੇੇ |ਵੱਜਕੇ |ਵਜਕੇ |ਵਜ |ਅੋ ਕਲਾਕ |ਅੋ ਕਲੋੋਕ |)\s*", ["hour", "minute", "meridiam"], "exact_time"],
                "IntervalTimeWithoutColon": [r"\s+(\d{1,2} |)\s*(- |ਤੋਂ  |ਯਾ |ਜਾਂ |ਅਤੇ |)\s*(\d{1,2})\s+(ਏ.ਐੱਮ.|ਪੀ.ਐੱਮ.|ਪੀ ਐਮ|ਐਮ|ਵੱਜੇੇ|ਵਜੇੇ|ਵੱਜਕੇ|ਵਜਕੇ|ਵਜ|ਅੋ ਕਲਾਕ|ਅੋ ਕਲੋੋਕ)\s+", ["hour", "minute", "meridiam"], "exact_time"],
                "intervalExactTime": [r"\s+(\d{1,2}):(\d{1,2})\s+(- |ਤੋਂ  |ਯਾ |ਜਾਂ |ਅਤੇ |)\s*(\d{1,2}):(\d{1,2})\s+(ਏ.ਐੱਮ |ਪੀ.ਐੱਮ |ਪੀ ਐਮ |ਐਮ |ਵੱਜੇੇ |ਵਜੇੇ |ਵੱਜਕੇ |ਵਜਕੇ |ਵਜ |ਅੋ ਕਲਾਕ |ਅੋ ਕਲੋੋਕ |)\s*", ["hour", "minute", "meridiam"], "exact_time"],
                "relativeTime": [r"\s+(\d{1,2})\s+(ਘੰਟੇ|ਘੰਟਾ|ਘੰਟਿਆਂ|ਆਵਰ|ਆਰ|ਆਵਰਜ਼)\s+", ["hour"], "relative_time"],
                "intervalRelativeTime": [r"\s+(\d{1,2} |)\s*(- |ਤੋਂ  |ਯਾ |ਜਾਂ |ਅਤੇ |)\s*(\d{1,2})\s+(ਘੰਟੇ|ਘੰਟਾ|ਘੰਟਿਆਂ|ਆਵਰ|ਆਰ|ਆਵਰਜ਼)\s*", ["hour"], "relative_time"],
                "intervalExactMinutesTime": [r"\s+(\d{1,2} |)\s*(- |ਤੋਂ  |ਯਾ |ਜਾਂ |ਅਤੇ |)\s*(\d{1,2})\s+(ਮਿੰਟ|ਮਿਨਟ|ਮੀਨਟ)\s+", ["minute"], "relative_minute"],
                "exactMinutesTime": [r"\s+(\d{1,2})\s+(ਮਿੰਟ|ਮਿਨਟ|ਮੀਨਟ)\s+", ["minute"], "exact_minute"],
                "daytime": [r"\s+(ਸ਼ਾਮ|ਨਿਸ਼ਾ|ਰਾਤ|ਰਾਤਰੀ|ਨਾਈਟ|ਸਵੇਰ|ਸਵੇਰੇੇ|ਮਾਰਨਿੰੰਗ|ਆਫਟਰਨੂੂਨ|ਦੁਪਹਿਰ|ਦੁਪੈੈਰ|ਦੁਪੈੈਰੇੇ|ਸਕਿੰਟ|ਸਿਕੇੰੰਡ|ਹੁਣੇ)\s+", ["daytime"], "daytime"]
            }

        if lang == "english":
            return {
                "exactTime": [r"\s+(\d{1,2}):(\d{1,2})\s+(am |pm |p.m. |a.m. |baje |bajkar |o'clock |)\s*", ["hour", "minute", "meridiam"], "exact_time"],
                "IntervalTimeWithoutColon": [r"\s+(\d{1,2} |)\s*(- |to |or |and |)\s*(\d{1,2})\s+(am|pm|p.m.|a.m.|baje|bajkar|o'clock)\s+", ["hour", "minute", "meridiam"], "exact_time"],
                "intervalExactTime": [r"\s+(\d{1,2}):(\d{1,2})\s+(- |to |or |and |)\s*(\d{1,2}):(\d{1,2})\s+(am |pm |p.m. |a.m. |baje |bajkar |o'clock |)\s*", ["hour", "minute", "meridiam"], "exact_time"],
                "intervalRelativeTime": [r"\s+(\d{1,2} |)\s*(- |to |or |and |)\s*(\d{1,2})\s+(hour|hours|ghanta|ghante)\s+", ["hour"], "relative_time"],
                "intervalExactMinutesTime": [r"\s+(\d{1,2} |)\s*(- |to |or |and |)\s*(\d{1,2})\s+(minute|minutes)\s+", ["minute"], "relative_minute"],
                "daytime": [r"\s+(evening|night|tonight|shaam|raat|subah|morning|afternoon|noon|second|din|right away|right now)\s+", ["daytime"], "daytime"]
            }

        if lang == "gujrati":
            return {
                "exactTime": [r"\s+(\d{1,2}):(\d{1,2})\s+(એમ |પીએમ |પિએમ |એમ |વાગ્યે |વાગે |વાગીને |ઓ કલોક |કલાકે |)\s*", ["hour", "minute", "meridiam"], "exact_time"],
                "IntervalTimeWithoutColon": [r"\s+(\d{1,2} |)\s*(- |થી |અથવા |અને |)\s*(\d{1,2})\s+(એમ|પીએમ|પિએમ|એમ|વાગ્યે|વાગે|વાગીને|ઓ કલોક|કલાકે)\s+", ["hour", "minute", "meridiam"], "exact_time"],
                "intervalExactTime": [r"\s+(\d{1,2}):(\d{1,2})\s+(- |થી |અથવા |અને |)\s*(\d{1,2}):(\d{1,2})\s+(એમ |પીએમ |પિએમ |એમ |વાગ્યે |વાગે |વાગીને |ઓ કલોક |કલાકે |)\s*", ["hour", "minute", "meridiam"], "exact_time"],
                "intervalRelativeTime": [r"\s+(\d{1,2} |)\s*(- |થી |અથવા |અને |)\s*(\d{1,2})\s+(કલાક|કલાકો|હવર|આર|આવર)\s+", ["hour"], "relative_time"],
                "intervalExactMinutesTime": [r"\s+(\d{1,2} |)\s*(- |થી |અથવા |અને |)\s*(\d{1,2})\s+(મીનીટ|મીનીટે|મિનીટ્સ)\s+", ["minute"], "relative_minute"],
                "daytime": [r"\s+(સાંજ|સાંજે|રાત|નાઈટ|સવાર|મોર્નિંગ|આફ્ટરનૂન|બપોર|હમણાં|અત્યારે)\s+", ["daytime"], "daytime"]
            }




